[{"title": "Inflation Hits New 40-Year High of 8.5%: Why Prices Keep Climbing", "domain": "cnet.com", "url": "https://www.cnet.com/personal-finance/inflation-hits-new-40-year-high-of-8-5-why-prices-keep-climbing/", "content": "Nuthawut Somsuk/iStock/Getty Images\n\nFrom your purchases at the grocery store to the dollar tag of rent across the US, consumer prices are soaring across the country. Your dollar doesn't have the purchasing power it used to, and that's a problem.\n\nInflation climbed by 8.5% through March, according to the Consumer Price Index. The CPI is a key indicator of inflation, defined as the sustained rise in the cost of living. The increase marks inflation's fastest annual rise since December 1981. Core inflation, which measures all items minus food and gas, rose 6.5%. This kind of sustained and increased inflation may point to something more enduring.\n\nInflation isn't inherently good or bad -- when kept in check, it's a sign of a healthy economy. It keeps us spending rather than tucking our cash under a mattress. Inflation rates have remained steady in recent decades, but now some worry that current prices will keep climbing to the point where consumers are squeezed, undermining the economic recovery. In the face of soaring prices, we're forced to look for ways to hedge against inflation, as rising prices are costing families $300 more each month. And if inflation continues rising, it may threaten labor market participation by messing with price stability, which the Fed is working to get back on track in the post-pandemic era.\n\nWhat does this mean for you? Here are some key things you need to know about inflation, how it can impact your budget and how it impacts your spending power.\n\nWhat is inflation?\n\nSimply put, inflation is a sustained increase in consumer prices. It means a dollar bill doesn't get you as much as it did before, whether you're at the grocery store or a used car lot.\n\nInflation is usually caused by either increased demand -- such as COVID-wary consumers being finally ready to leave their homes and spend money -- or supply-side factors like increases in production costs.\n\nInflation is a given over the long term, and it requires some historical context to mean anything. For example, in 1985, the cost of a movie ticket was $3.55. Today, watching a film in the theater will easily cost you $13 for the ticket alone -- never mind the popcorn, candy or soda. A $20 bill in 1985 would buy you almost four times what it buys today.\n\nTypically, we see a 2% inflation rate from year to year. It's when the rate rises above this percentage in a short period of time when inflation becomes a concern.\n\nOver the past century, there have only been a few years when the annual inflation rate in the US has been a negative number. But we also measure inflation in the short term, where we can see sharper rises, such as the price increase for used cars and trucks in June 2021. At that time, the CPI stated that prices shot up by 10.5% in just one month -- a dramatic increase that has since petered out, with monthly price changes for used cars dipping into the negatives the following months.\n\nHow do we know if we're in a period of inflation?\n\nInflation isn't a physical phenomenon we can observe. It's an idea that's backed by a consensus of experts who rely on market indexes and research.\n\nOne of the most closely watched gauges of US inflation is the Consumer Price Index, which is produced by the federal Bureau of Labor Statistics and based on the diaries of urban shoppers. CPI reports track data on 80,000 products, including food, education, energy, medical care and fuel.\n\nThe BLS also puts together a Producer Price Index, which tracks inflation more from the perspective of the producers of consumer goods. The PPI measures changes in seller prices reported by industries like manufacturing, agriculture, construction, natural gas and electricity.\n\nAnd there's also the Personal Consumption Expenditures price index, prepared by the Bureau of Economic Analysis, which tends to be a broader measure, because it includes all goods and services consumed, whether they're bought by consumers, employers or federal programs on consumers' behalf.\n\nThe Labor Department announced that the CPI increased by 5% in May 2021, following an increase of 5% in April of the same year -- the rise that first caused a stir among market watchers.\n\nBut that rise in the CPI, in and of itself, doesn't mean we're necessarily in a cycle of rising inflation. That's where the Federal Reserve comes in.\n\nHow the Federal Reserve can fix things\n\nThe Fed, created in 1913, is the control center for the US banking system and handles the country's monetary policy. It's made up of 12 regional Federal Reserve banks and 24 branches and run by a board of governors, all of whom are voting members of the Federal Open Market Committee, which is the Fed's monetary policymaking body.\n\nWhile the BLS reports on inflation, the Fed moderates inflation and employment rates by managing the supply of money and setting interest rates. Part of its mission is to keep average inflation at a steady 2% rate. It's a delicate balancing act, and the main lever it can pull is to adjust interest rates. In general, when interest rates are low, the economy and inflation grow. And when interest rates are high, the economy and inflation slow.\n\nWith rates well over the 2% inflation goal, the Fed raised interest rates in March.\n\nShould we be worried?\n\nMaybe, though it's too soon to say. While you're seeing the cost of day-to-day living go up, it's possible it's just the normal and expected response to the previously stalled-out pandemic economy, which is rapidly strengthening.\n\nThere's been no consensus among experts that inflation will become a sustained cycle and become entrenched; it's just on their radar. However, the accelerating pace of inflation -- and the fact that it's seeping into portions of the economy undisturbed by the pandemic -- could mean the situation is worse than originally thought.\n\nFor now, the Fed continues to be on track to end its bond-buying program by early March and will continue to monitor the economy to see when it is appropriate to raise interest rates, which could be as soon as late March.\n\nIt's worth noting that the Fed has been generally successful in keeping inflation at or below its target of 2% for almost a decade. But these are unprecedented times, and this is definitely an issue to keep an eye on.\n\nWhat about the other 'flations': Deflation, hyperinflation, stagflation?\n\nThere are a few other \"flations\" worth knowing about. Let's brush up.\n\nDeflation\n\nAs the name infers, deflation is the opposite of inflation. Economic deflation is when the cost of living goes down. (We saw this, for example, during parts of 2020.) Widespread deflation can have a devastating impact on an economy. Throughout US history, deflation tends to accompany economic crises. Deflation can portend an oncoming recession as consumers tend to halt buying in hopes that prices will continue to fall, thus creating a drop in demand. Eventually, this leads to consumers spending even less, lower wages and higher unemployment rates.\n\nHyperinflation\n\nThis economic cycle is similar to inflation in that it involves an increase in the cost of living. However, unlike inflation, hyperinflation takes place rapidly and is out of control. Many economists define hyperinflation as the increase in prices by 1,000% per year. Hyperinflation is uncommon in developed countries like the US. But remember Venezuela's economic collapse in 2018? That was due in part to the country's inflation rate hitting more than 1,000,000%.\n\nStagflation\n\nStagflation is when the economy enters a period of stagnation. In these instances, unemployment is high, prices are rising and economic growth is slow. Stagflation was first recognized in the 1970s after the energy crisis. Simultaneously, inflation doubled, the US experienced negative GDP growth and unemployment reached 9%. Memories of this dark economic time factor into current fears of inflation spiraling out of control, even though the circumstances are very different.\n\nMichelle Meyers and Justin Jaffe contributed to this report.", "id": "62562d3bfca032fa638009bc"}, {"title": "Economy: As inflation booms, does recession loom?", "domain": "theweek.com", "url": "https://theweek.com/business/1015326/economy-as-inflation-booms-does-recession-loom", "content": "The smartest insight and analysis, from all perspectives, rounded up from around the web:\n\nThe time for debate is over, said the Financial Times in an editorial: The Federal Reserve must focus on getting inflation under control. Prices rose by a staggering 9.1 percent last month compared with a year ago, reaching a 40-year high. Until recently, it was possible to hope for a soft landing, a mild slowdown that would \"tame the inflation problem and get the economy back to robust growth without too much pain.\" Now, though, \"the decision seems straightforward: raise rates rapidly.\" Taking strong steps now, even if they mean a recession, is better than letting inflation turn into \"a vicious cycle.\" If the Fed moves too fast, \"it's easier to reverse course by loosening monetary policy than it is to bear down on an inflationary problem that has seeped into the groundwater.\"\n\nSticker shock is everywhere, said Leslie Patton in Bloomberg. Gasoline and milk prices get most of the attention, but \"the price for a pound of white bread in the U.S. hit a record $1.69 in June, a 12 percent jump from a year earlier.\" The higher grocery bills are starting to produce cracks in demand, with food giants like PepsiCo and Conagra reporting declining sales volume. \"I feel like the month just started, and I've spent $650 on groceries already,\" said Brownsburg, Indiana, resident Krista Hoffman, who says she has cut out items like juice boxes and is planning more meatless meals. Inflation optimists can discount the numbers for food and energy, which tend to be very volatile, said Justin Fox, also in Bloomberg. But more worrying is that \"core inflation,\" which removes those prices, is \"clearly accelerating.\"", "id": "62dbf742b03a36944c182e69"}, {"title": "'Peak inflation' trade is driving financial markets as investors brace for U.S. economic slowdown", "domain": "marketwatch.com", "url": "https://www.marketwatch.com/story/peak-inflation-trade-is-driving-financial-markets-as-investors-brace-for-economic-slowdown-11658512541", "content": "", "id": "62dc1914b03a36944c183115"}, {"title": "Unleaded Gasoline Futures Declined 26 Percent, Has Inflation Peaked This Economic Cycle?", "domain": "mishtalk.com", "url": "https://mishtalk.com/economics/unleaded-gasoline-futures-declined-26-percent-has-inflation-peaked-this-economic-cycle", "content": "Unleaded Gasoline Futures Courtesy of Trading Economics\n\nThe Wall Street Journal reports There Are Signs Inflation May Have Peaked, but Can It Come Down Fast Enough?\n\nGrowing signs that price pressures are easing suggest that June's distressingly high 9.1% increase in consumer prices will probably be the peak. But even if inflation indeed comes down, economists see a slow pace of decline. Ed Hyman, chairman of Evercore ISI, pointed to many indicators that 9.1% might have been the top. Gasoline prices have fallen around 10% from their mid-June high point of $5.02 a gallon, according to AAA. Wheat futures prices have fallen by 37% since mid-May and corn futures prices are down 27% from mid-June. The cost of shipping goods from East Asia to the U.S. West Coast is 11.4% lower than a month ago, according to Xeneta, a Norway-based transportation-data and procurement firm. Aichi Amemiya, U.S. economist at Nomura, said that though it is too early to call it, his forecast sees June as the peak for the annual measure of overall inflation. However, the month-over-month change in core CPI will be key to watch in coming months, he said. If it slows from June's pace of 0.7% to 0.3% on a sustained basis by year-end, he expects the Fed to start planning to ease up on rate increases. That, however, will be hard to achieve, said Mr. Amemiya, \"which means the Fed will likely continue tightening even after the economy enters a recession.\"\n\n\"MoM change in core CPI will be key. If it slows from June's 0.7% to 0.3% on sustained basis by YE, he expects Fed to plan to ease up. That will be hard to achieve 'which means Fed will likely continue tightening even after economy enters recession.'\"\n\nLumber Futures\n\nLumber Futures Courtesy of Trading Economics\n\nLumber Declines\n\nLumber futures are down 65 percent from the May 3, 2021 peak.\n\nLumber futures are down 59 percent from the secondary spike to 1441 in February of 2022.\n\nThe Fed does not directly count home prices as inflation, but housing has slowed dramatically and with it the demand for lumber.\n\nWheat Futures\n\nFood For Thought\n\nWheat futures have declined about 36 percent from the May 9, 2022 peak.\n\nAlthough there are significant declines in nearly every commodity, prices of energy, lumber, and wheat still remain elevated to historical norms.\n\nMoreover, raw commodity prices are just one factor in overall pricing. Labor costs are a key component of finished goods, and labor costs are still rising.\n\nPaul Krugman \"I Was Wrong\"\n\nAbout Supply Chains\n\nPaul Krugman vs Nassim Taleb\n\nWhat About Wages\n\nNationally, Rent is Still Rising, Compounding the Fed's Recession Woes\n\nYear-Over-Year Inflation has likely peaked. And given the steep plunge in gasoline prices, the CPI for July may be negative.\n\nBut rent makes up over 31 percent of the CPI and rent is still going up.\n\nFor discussion, please Nationally, Rent is Still Rising, Compounding the Fed's Recession Woes\n\nIt may be a few more months before rent peaks. I will have an update on rent next week.\n\nThis post originated at MishTalk.Com.\n\nThanks for Tuning In!\n\nPlease Subscribe to MishTalk Email Alerts.\n\nSubscribers get an email alert of each post as they happen. Read the ones you like and you can unsubscribe at any time.\n\nIf you have subscribed and do not get email alerts, please check your spam folder.\n\nMish", "id": "62dc7a40b03a36944c183898"}, {"title": "LISTEN: A recession may be the only way to stop inflation", "domain": "komonews.com", "url": "https://komonews.com/news/podcast/politicast/listen-a-recession-may-be-the-only-way-to-stop-inflation", "content": "", "id": "62dd59a3b03a36944c184418"}, {"title": "The Inflation Picture Darkens", "domain": "forbes.com", "url": "https://www.forbes.com/sites/miltonezrati/2022/07/24/the-inflation-picture-darkens/", "content": "", "id": "62dd7167b03a36944c1845ba"}, {"title": "Jesse Ramos: The solution to the inflation crisis", "domain": "missoulian.com", "url": "https://missoulian.com/opinion/columnists/jesse-ramos-the-solution-to-the-inflation-crisis/article_5d909498-aaa2-5ba4-a5ff-f18ad76712f1.html", "content": "Inflation has now reached a 40-year high of 9.1% in June. This has devastating impacts on Americans. At this point, most Americans want the ability to afford rent and food, fill their gas tank, and take that summer vacation. They don't want to spend their lives constantly worrying about money. They want things to go back to normal.\n\nI recently made the case that inflation is not primarily caused by price gouging and the war in Ukraine. I am not alone in that viewpoint, as Jerome Powell, the chairman of the Fed, agrees with me. Powell recently admitted that inflation is caused by a government-induced overheating of the U.S. economy.\n\nAnd despite the rhetoric, the blame for inflation does not lie with just one political party. This fact is crucial to implementing better policy in the future and not making the same mistakes.\n\nUnfortunately, neither Congress nor the president can take back the lockdowns, the multiple rounds of ill-advised stimulus checks, and the trillions in bailouts to state and local governments and corporations.\n\nHowever, they can get control of the current budget deficit and the issuance of new debt. Every dollar of deficit spending puts pressure on the Fed to buy up the new debt, which increases the money supply and further devalues money currently in the system. Americans cannot afford a single cent more of Fed-injected money that undermines their purchasing power.\n\nAll levels of government can help end the inflation fire by removing barriers inhibiting production and profitability for enterprises: I am talking about regulations in the energy sector and the larger economy. More entrepreneurship and productivity will help us get out of this mess, but the government bars the way. Luckily, the governor is leading the way in Montana with his Red Tape Relief Commission.\n\nI know some are blaming these prices on greedy \"price gougers.\" There are always those willing to leverage human greed to keep the eyes of the public off their failures. However, if it were as simple as price gouging, the stock market would be booming, with investors looking to participate in those profits and protect their purchasing power in the face of inflation. But the S&P 500 index is down nearly 19% year to date. This is because most corporations comprising the index are experiencing shrinking corporate profits.\n\nThe Federal Reserve also plays a significant role in slowing down inflation. It should continue to raise the Federal Funds Rate and pay interest on reserves while simultaneously reducing the assets on its balance sheet. The Fed will need to pursue a more neutral plan focused mainly on curbing inflation. Unfortunately, the Fed has placed itself in a challenging position to do these things. It procrastinated tightening for too long.\n\nThe result of this might have to be raising rates higher and faster than the Fed otherwise would have, leaving it with only two options: Fully commit to fighting inflation and possibly induce a recession or continue to let inflation destroy the purchasing power of the American people.\n\nIn the future, Congress must review the Fed's authorities and objectives while fixing the way the federal government budgets. For years, despite proclaiming independence, the Fed has over-accommodated Congress' excessive spending and has focused too much on issues best left up to the private sector, such as \"maximum employment.\"\n\nWe have solutions at our fingertips to get inflation under control. Hopefully, our lawmakers see these solutions as the opportunity to help the American people.\"", "id": "62de7963b03a36944c185691"}, {"title": "Here's why inflation may have peaked -- but a recession could still loom", "domain": "businessinsider.com", "url": "https://www.businessinsider.com/inflation-peak-economy-recession-markets-mohamed-el-erian-stocks-2022-7", "content": "I hope this newsletter finds you well, even as inflation runs amok and everything from groceries to gas is more expensive than a year ago. Phil Rosen here, coming to you from Los Angeles today.\n\nNo matter how many times the Fed told us inflation was transitory, high prices have been hard to ignore. But one top economist predicted that, finally, our wallets may get some respite.\n\nBut there's a catch. There's always a catch.\n\nHere we go.\n\nIf this was forwarded to you, sign up here. Download Insider's app here.\n\nMohamed El-Erian. Rob Kim/Getty Images\n\n1. Inflation might have hit its peak, but there's still pain ahead even if prices start to fall, according to Mohamed El-Erian, famed economist and advisor to Allianz.\n\nHere's what he told CNBC on Friday:\n\n\"I think inflation has peaked in the US, at least for the next three to four months...But the problem is not that inflation is going to come down -- that's a really good thing. The problem is that inflation is going to come down with growth probably going into a recession, and that's not good news.\"\n\nGoldman Sachs said a broad slowdown would hit Corporate America too, even though it has so far weathered 41-year high inflation without much impact to profitability.\n\nIn the first half of the year, Americans have picked up the slack for corporations. But soon US companies are going to find it increasingly difficult to pass on price hikes to consumers, Goldman said, and that's left earnings estimates far too optimistic.\n\n\"Because employment has been strong, the economy has been strong, consumers have had savings -- so they've been able to pass through most of that to the consumer,\" a senior Goldman Sachs strategist said.\n\n\"I think it will become more difficult to pass that through to the consumer, and we are expecting margins to be squeezed,\" she added.\n\nIn other news:\n\nGetty Images North America/Getty Images\n\n2. US stock futures rise early Monday, as investors brace for further interest rate decisions by the Federal Reserve later this week. Meanwhile, bitcoin fell back below the $22,000 level. Here are today's market moves.\n\n3. On the docket: Linde plc, Cadence Design Systems Inc., and Axis Bank Ltd, all reporting.\n\n4. UBS recommended this batch of stocks that can generate strong returns during a \"historically fast slowdown\" that could turn into a recession. According to the firm's analysts, these are the names that they have high conviction in despite the current and brutal market. Here's the list of 22 stocks.\n\n5. Russian oil that usually goes to China is making its way to India instead as competition for cheap crude heats up. Cargoes carrying Russian oil were en route to east India on Friday, where an Indian Oil Corp refinery is located. But that's not all -- Iran and Venezuela are also ramping up competition to sell crude to India and China.\n\n6. There's a new type of lumber contract set to shake up the futures market. And its going to allow the key commodity to be moved at one-quarter the volume compared to old contracts. A lumber broker in Colorado told Insider that the switch could skyrocket the number of orders flowing into the lumber market and smooth out price volatility.\n\n7. \"Rich Dad Poor Dad\" author Robert Kiyosaki warned that raging US inflation could spark a historic depression. The personal finance guru said surging prices and workforce cuts are red flags for a steep downturn. Kiyosaki also sounded the alarm on home sales and foreclosures in a bleak prediction for US real estate.\n\n8. Bank of America is home to the most bearish stock chief on Wall Street. Savita Subramanian has slashed her target for US indexes lower than her competitors have. But she said investors should make these 8 moves to profit from an increasingly difficult market.\n\n9. Crypto billionaire Sam Bankman-Fried has big plans to bail out crypto companies amid the market rout. Speaking with Bloomberg, he said FTX keeps its treasury in dollars to curb risk, and explained how he assesses which troubled firms to help. Plus, he broke down why it's okay to make a \"moderately bad\" deal in the current landscape.\n\nEthereum Price on July 25 Markets Insider\n\n10. Ether jumped as much as 50% over the last month. And it has beaten out bitcoin's gains over the same stretch, as enthusiasm for the crypto grows after an Ethereum Foundation member sparked rumors about an upcoming update. However, ether was down 4% early Monday. Follow the latest price moves here.\n\nKeep up with the latest markets news throughout your day by checking out The Refresh from Insider, a dynamic audio news brief from the Insider newsroom. Listen here.\n\nCurated by Phil Rosen in New York. (Feedback or tips? Email prosen@insider.com or tweet @philrosenn).\n\nEdited by Max Adams (@maxradams) in New York and Hallam Bullock (@hallam_bullock) in London.", "id": "62deca596134dc31786d3414"}, {"title": "The 2024 Recession", "domain": "247wallst.com", "url": "https://247wallst.com/economy/2022/07/25/the-2024-recession/", "content": "The 2024 Recession\n\nMany economists believe that the U.S. will enter a recession next year. Several think it has already started. One debate about the downturn is how long it will last. Will it be two or three quarters? Alternatively, will it be two or three years?\n\nLarry Summers, economist, former Treasury Secretary, and a past president of Harvard, continues to make one of the most powerful arguments that inflation will trigger a recession, and probably a substantial one. Summers recently appeared on CNN and commented: \"I think there is a very high likelihood of recession. When we've been in this kind of situation before, recession has essentially always followed. When inflation has been high and unemployment has been low, soft landings represent a kind of triumph of hope over experience. I think we're very unlikely to see one.\"\n\nAmong the data that back up his assertion is inflation, which is at a four-decade high. In June, the consumer price index was up 9.1% compared with the same month a year ago. Prices on items Americans use the most - particularly gas, oil, and some foods - rose much more rapidly. Americans have started to lose their purchasing power.\n\nThe Federal Reserve's plans to raise rates to push down inflation have failed according to its critics. Its actions should have started last year. This year's quarterly increases of .75% a quarter are not nearly aggressive enough. The central bank has stated that rate increases that are too aggressive will tip the U.S. economy into a GDP growth downturn. (\"Negative growth\" has been used to describe this, but is an odd turn of phrase\")\n\nAmerica also has to face the fact that most of the world's advanced economies have problems worse than the U.S. Europe's largest economies may already be in recession. There is growing evidence that China's economy has stalled. Experience has shown that a recession in some of the world's largest economies spreads across all of them.\n\nMost of the evidence about when a recession begins and how long it lasts show that not only does the U.S. face a recession, but that it may well last for several quarters.", "id": "62df08b86134dc31786d3c15"}, {"title": "Editorial: Fed has no good choice between inflation and recession", "domain": "herald-dispatch.com", "url": "https://www.herald-dispatch.com/opinion/editorial-fed-has-no-good-choice-between-inflation-and-recession/article_a4525d96-20fb-5b0b-8b5a-8f67b1c494d5.html", "content": "Country\n\nUnited States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's Socialist Republic of Algeria, People's Democratic Republic of American Samoa Andorra, Principality of Angola, Republic of Anguilla Antarctica (the territory South of 60 deg S) Antigua and Barbuda Argentina, Argentine Republic Armenia Aruba Australia, Commonwealth of Austria, Republic of Azerbaijan, Republic of Bahrain, Kingdom of Bangladesh, People's Republic of Barbados Belarus Belgium, Kingdom of Belize Benin, People's Republic of Bermuda Bhutan, Kingdom of Bolivia, Republic of Bosnia and Herzegovina Botswana, Republic of Bouvet Island (Bouvetoya) Brazil, Federative Republic of British Indian Ocean Territory (Chagos Archipelago) British Virgin Islands Brunei Darussalam Bulgaria, People's Republic of Burkina Faso Burundi, Republic of Cambodia, Kingdom of Cameroon, United Republic of Cape Verde, Republic of Cayman Islands Central African Republic Chad, Republic of Chile, Republic of China, People's Republic of Christmas Island Cocos (Keeling) Islands Colombia, Republic of Comoros, Union of the Congo, Democratic Republic of Congo, People's Republic of Cook Islands Costa Rica, Republic of Cote D'Ivoire, Ivory Coast, Republic of the Cyprus, Republic of Czech Republic Denmark, Kingdom of Djibouti, Republic of Dominica, Commonwealth of Ecuador, Republic of Egypt, Arab Republic of El Salvador, Republic of Equatorial Guinea, Republic of Eritrea Estonia Ethiopia Faeroe Islands Falkland Islands (Malvinas) Fiji, Republic of the Fiji Islands Finland, Republic of France, French Republic French Guiana French Polynesia French Southern Territories Gabon, Gabonese Republic Gambia, Republic of the Georgia Germany Ghana, Republic of Gibraltar Greece, Hellenic Republic Greenland Grenada Guadaloupe Guam Guatemala, Republic of Guinea, Revolutionary People's Rep'c of Guinea-Bissau, Republic of Guyana, Republic of Heard and McDonald Islands Holy See (Vatican City State) Honduras, Republic of Hong Kong, Special Administrative Region of China Hrvatska (Croatia) Hungary, Hungarian People's Republic Iceland, Republic of India, Republic of Indonesia, Republic of Iran, Islamic Republic of Iraq, Republic of Ireland Israel, State of Italy, Italian Republic Japan Jordan, Hashemite Kingdom of Kazakhstan, Republic of Kenya, Republic of Kiribati, Republic of Korea, Democratic People's Republic of Korea, Republic of Kuwait, State of Kyrgyz Republic Lao People's Democratic Republic Latvia Lebanon, Lebanese Republic Lesotho, Kingdom of Liberia, Republic of Libyan Arab Jamahiriya Liechtenstein, Principality of Lithuania Luxembourg, Grand Duchy of Macao, Special Administrative Region of China Macedonia, the former Yugoslav Republic of Madagascar, Republic of Malawi, Republic of Malaysia Maldives, Republic of Mali, Republic of Malta, Republic of Marshall Islands Martinique Mauritania, Islamic Republic of Mauritius Mayotte Micronesia, Federated States of Moldova, Republic of Monaco, Principality of Mongolia, Mongolian People's Republic Montserrat Morocco, Kingdom of Mozambique, People's Republic of Myanmar Namibia Nauru, Republic of Nepal, Kingdom of Netherlands Antilles Netherlands, Kingdom of the New Caledonia New Zealand Nicaragua, Republic of Niger, Republic of the Nigeria, Federal Republic of Niue, Republic of Norfolk Island Northern Mariana Islands Norway, Kingdom of Oman, Sultanate of Pakistan, Islamic Republic of Palau Palestinian Territory, Occupied Panama, Republic of Papua New Guinea Paraguay, Republic of Peru, Republic of Philippines, Republic of the Pitcairn Island Poland, Polish People's Republic Portugal, Portuguese Republic Puerto Rico Qatar, State of Reunion Romania, Socialist Republic of Russian Federation Rwanda, Rwandese Republic Samoa, Independent State of San Marino, Republic of Sao Tome and Principe, Democratic Republic of Saudi Arabia, Kingdom of Senegal, Republic of Serbia and Montenegro Seychelles, Republic of Sierra Leone, Republic of Singapore, Republic of Slovakia (Slovak Republic) Slovenia Solomon Islands Somalia, Somali Republic South Africa, Republic of South Georgia and the South Sandwich Islands Spain, Spanish State Sri Lanka, Democratic Socialist Republic of St. Helena St. Kitts and Nevis St. Lucia St. Pierre and Miquelon St. Vincent and the Grenadines Sudan, Democratic Republic of the Suriname, Republic of Svalbard & Jan Mayen Islands Swaziland, Kingdom of Sweden, Kingdom of Switzerland, Swiss Confederation Syrian Arab Republic Taiwan, Province of China Tajikistan Tanzania, United Republic of Thailand, Kingdom of Timor-Leste, Democratic Republic of Togo, Togolese Republic Tokelau (Tokelau Islands) Tonga, Kingdom of Trinidad and Tobago, Republic of Tunisia, Republic of Turkey, Republic of Turkmenistan Turks and Caicos Islands Tuvalu Uganda, Republic of Ukraine United Arab Emirates United Kingdom of Great Britain & N. Ireland Uruguay, Eastern Republic of Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam, Socialist Republic of Wallis and Futuna Islands Western Sahara Yemen Zambia, Republic of Zimbabwe", "id": "62e00d7f6134dc31786d56fb"}, {"title": "Hiltzik: Inflation is starting to come down", "domain": "netionaldastak.com", "url": "https://netionaldastak.com/hiltzik-inflation-is-starting-to-come-down/", "content": "For fans of code-breaking, Thursday morning's Wall Street Journal home page provided plenty of material to perplex and entertain.\n\nThere was an article documenting a sharp price decline in memory chips, which are essential parts in cars, smartphones and household appliances. Another about declines in shares of fertilizer companies, driven by \"falling crop prices.\"\n\nYet a third article reported a narrowed trade gap due to a pullback in the American frenzy for foreign goods. There was also a report that rates on 30-year mortgages had fallen sharply, to 5.3% from 5.7% a week ago.\n\nAmid all that, as the Journal observed, the minutes of the Federal Reserve Board's rate-setting meeting released Wednesday suggested that inflation panic drove its decision to raise rates by three-quarters of a percentage point, the largest increase in 28 years.\n\nWhat's wrong with this picture?\n\nSigns are proliferating that the inflation rate peaked in February and March. That hasn't been too visible in the most recent data releases from the Bureau of Labor Statistics but may become evident with the agency's next report on the consumer price index, due July 13.\n\nThe report may show inflation still high, possibly even exceeding the rate of previous months. Economists surveyed by Bloomberg say they expect it to be higher by nearly 9% at an annual rate.\n\nBut the inflation report looks back--it's not a snapshot of inflation in real time. So if inflation really is ebbing, the July 13 report may overstate the current rate.\n\nIt's proper to stipulate that even as inflation ebbs and prices begin to come down, the costs of many goods and commodities remain materially higher than they were a year ago. That means that the pain of the last few months will linger.\n\nThe national average price of gasoline, for instance, has been falling for the better part of a month, to an average of $4.75 a gallon for regular, down from $4.92 a month ago, according to AAA. That will bring some relief to motorists, but a year ago the average price of regular gas was $3.14.\n\nStill, the falling pace of price increases suggests that the Fed, which is fixated on inflation and has a tendency to fight the last war, may be misreading the economic environment.\n\nThe minutes released Wednesday, along with subsequent statements by Fed Chairman Jerome H. Powell and other Fed governors, indicate that its determination to control inflation is so firm that it's willing to risk provoking an economic downturn to achieve its goal.\n\nAs we've observed before, sacrificing jobs in the cause of reducing inflation is a cure worse than the disease. More to the point, it places the burden of monetary policy on the backs of the wrong people. Rank-and-file workers and their wages have not been the drivers of inflation in the last year. Rather, it's been driven by structural issues in the post-pandemic global supply chain and by corporate actions designed to fatten profits, which are then funneled to executives and shareholders.\n\nIndeed, the principal inflation remedy in the Fed's medicine chest -- raising interest rates -- is ineffective against the most important drivers of inflation today. U.S. interest rates have nothing to do with the constraints on supplies of computer chips and other goods and parts resulting from COVID-related factory shutdowns in China. Interest rate increases could do nothing to reduce logjams at U.S. ports that kept shipped products from reaching consumers.\n\nOil prices, which are set in the global marketplace, are affected by the law of supply and demand, but if Powell and company aim to reduce U.S. demand by stifling the American economy generally, there will be lots of collateral damage in U.S. households for marginal gain, at best.\n\nGas prices have declined 21 days in a row. How did Joe Biden do this? -- David Pakman (@dpakman) July 6, 2022\n\nAs for the raw figures, the core consumer price index (that is, excluding food and energy), rose by an annualized 6.5% in March but fell to 6.0% in May. Including food and energy, the index reached 8.54% in March, fell to 8.3% in April and rose back to 8.58% in May. Rounding the figures made it seem as though the index rose from 8.5% to 8.6% from March to May, but obviously the change was smaller.\n\nThe Fed's preferred inflation gauge, the personal consumption expenditures price index or PCE, also peaked several months ago. Its core rate reached 5.3% in February on a year-over-year basis, and fell to 4.7% in May; its all-prices measure hit 6.6% in March and fell to 6.3% in May. The next PCE report from the Bureau of Economic Analysis is scheduled for July 29 and will cover the index for June.\n\nNow let's look at some price components, which have been helpfully compiled by Barry Ritholtz of Ritholtz Wealth Management and the Big Picture economic blog.\n\nMeltdown in wholesale gas prices today (white line) mean serious relief at the pump (yellow line) over the next couple weeks. pic.twitter.com/kAOw4kO7J2 -- Ian Shepherdson (@IanShepherdson) July 5, 2022\n\nFirst, oil. The price of benchmark West Texas Intermediate crude has fallen from its recent peak of $122.11 per barrel to less than $104 last Thursday after dipping below $100 the day before. The price was $65.57 on Dec. 1, before it got driven up by Russia's attack on Ukraine, which started Feb. 24.\n\nWholesale gas prices experienced what Ian Shephardson of Pantheon Macroeconomics labeled a \"meltdown\" in commodity trading of about 25% Thursday, presaging \"serious relief at the pump\" over the next couple of weeks. (Shepherdson says he expects \"much lower headline CPI/PCE\" figures for July and subsequent months.)\n\nThe prices of industrial metals have been plunging, with the Bloomberg index of those commodities falling by 38% since March. That may reflect expectations of a recession, but it could also be the unwinding of investor enthusiasm that had driven prices higher than was warranted.\n\nOcean shipping rates, as tracked by the supply chain research firm Drewry, have fallen sharply. The cost of shipping a 40-foot container from Shanghai to Los Angeles fell to $7,566 on July 5 from $12,424 in September, down by 40%.\n\nShipping rates are a reflection of economic activity and strains on the global supply chain, and a driver of inflation. Whether the fall in rates reflects a slowing economy or will help sustain the economy may be hard to know except in a rear-view mirror. In any event, it signals an easing of pressure on prices.\n\nWill these trends continue? Economic policymakers certainly hope so. In part that's because inflation expectations have the tendency to build on themselves.\n\n\"Inflation can be a self-fulfilling prophecy,\" Treasury Secretary Janet Yellen warned in November, when there was still hope that price surges would burn themselves out within a few short months. Whether that will be the case now is anyone's guess.", "id": "62e095236134dc31786d6938"}, {"title": "A Fed-induced recession is a medicine worse than the disease", "domain": "ft.com", "url": "https://www.ft.com/content/31b15e03-929f-40c1-b2f8-782df4bd6e37", "content": "Cookies on FT Sites\n\nWe use cookies for a number of reasons, such as keeping FT Sites reliable and secure, personalising content and ads, providing social media features and to analyse how our Sites are used.", "id": "62e0e9c16134dc31786d71d5"}, {"title": "Will hiking interest rates tackle inflation and recession? Even the Fed is confused.", "domain": "economictimes.indiatimes.com", "url": "https://economictimes.indiatimes.com/prime/money-and-markets/will-hiking-interest-rates-tackle-inflation-and-recession-even-the-fed-is-confused-/primearticleshow/93194153.cms", "content": "\"Everything that needs to be said has already been said. But since no one was listening, everything must be said again.\" -- Andre Gide 2021 - Inflation is transitory. 2022 - Inflation has peaked. 2023 - Inflation is.... The 2023 statement is not complete. Why? Because nobody knows the answer. Consider this: the latest 75 basis rate hike (on July 27) by the Federal Reserve has made debt expensive for US businesses. Loan payments have become", "id": "62e355b16134dc31786db822"}, {"title": "Can the Federal Reserve fix inflation", "domain": "shreveporttimes.com", "url": "https://www.shreveporttimes.com/story/money/2022/07/24/can-federal-reserve-fix-inflation/10126300002/", "content": "Tommy Williams\n\nYou have had a week to reflect on the \"sell discipline\" we discussed last week. I hope you are more clear now about when (and if) you should sell an investment that has fundamentally changed. Sometimes important things do change in negative ways. For example, whatever existed (perhaps a good dividend) that originally caught your interest- leading you to invest in something-looks like it will not sustain into the future. That could trigger a sell decision. However, just because something unrelated to the solid business model that once appealed to you has caused the price (not the value) to drop, it is no reason to head for the exits.\n\nThis week the mantra remains pretty much the same. The short term for the market looks pretty ugly. However, later this year-and into next year things look much better. Personally, I'm not changing anything based on recent market activity. I will always look for good \"entry points\" to purchase anything with a good tax-favored dividend and a great management team.\n\nHaving said that, I would be remiss not to mention Brian Wesbury's Monday Morning Outlook. He goes into great detail about the fight between the Federal Reserve and inflation. In short, he explains that the ugly monster is the result of money supply growth-which can't be controlled by simply raising interest rates. We are in unchartered territory with way too much money in the system chasing too few goods. Can it be corrected? He says yes. Former Federal Reserve Chairman Paul Volcker and then President Ronald Reagan did it in the late 1970's/early 1980's. By slowing the growth of money supply, Volcker took the Federal Reserve out of the business of \"juicing\" the economy. By cutting tax rates and reducing regulations Reagan revived the private sector. It helped that they also shrank the size and scope of the federal government. Believe it or not, there are some smart people around these days that can do similar things. What got us here (pandemic relief-PPP loans, government stimulus checks, etc) today is different than the prevailing conditions in the 1970's, but there is a way out.* So on that subject we'll have to wait hopefully and watch.\n\nIn the meantime, speaking of things that have changed-and have an economic impact, I ran into some reportable topics this week. As you know, we are an aging population. Later this month I will turn 70 myself! I have alerted Social Security to start sending me a monthly check. I waited until the last minute so as to maximize the payment, and there is no advantage in deferring past age 70. Hopefully, I'll live long enough to recoup some of the income I could have received for the past several years. If not, my wife will. Of particular interest, in 2019, 16.5% of Americans were 65 or older. By 2030 (in just 8 years) that number increases to 1 in 5 or 20% of our population.**. This certainly has financial implications as I'm depending on you youngsters to make your deposits into the system. My monthly checks and a meaningful portion of my medical bills will be depending on you! Just as my parents' generation depended on my contributions to government programs for their 65+ crowd.\n\nAnother really dire, but factual piece of information: More Americans died in 2021 than any year in American history.*** This includes the years during the Civil War (1860-1865). Of course, cancer and heart disease always lead the pack, but the fact that we are now at 1.021 million covid related deaths since the beginning of the Pandemic was certainly a factor.**** It is a shame, but though the virus related death and hospitalization rates are dramatically reduced, we obviously are not out of the woods on that front either.\n\nHowever, let me close on a positive note quoting one of my dear friends from the Seekers Sunday School class at First United Methodist Church: \"Don't ever bet against America!\" Last Sunday our class was treated to a wonderful message on HOPE and even a roughly read rendition of Merle Haggard's \"Are the good times really over for good?\". In 1981 he first recorded the song, and I leave you with his closing lines, \"The best of the free life is still yet to come. The good times ain't over for good!\"*****\n\nThe opinions, forecasts, and views expressed here are those of Tommy Williams and do not necessarily represent those of Williams Financial Advisors, Private Client Services, RFG Advisory, their employees, or their clients.\n\nThis material is for educational and informational purposes only. It is not legal, tax, or investment advice, nor a recommendation to buy, sell, or hold any specific security, nor an endorsement of any specific trading strategy. Always consult an attorney or tax professional regarding your specific legal or tax situation.\n\nSecurities offered by Registered Representatives through Private Client Services, member FINRA/SIPC. Advisory products and services offered by Investment Advisory Representatives through RFG Advisory, a Registered Investment Advisor. RFG Advisory, Williams Financial Advisors, LLC, and Private Client Services are unaffiliated entities. No advisory\n\n*Brian Wesbury, Chief Economist -First Trust, Monday Morning Outlook weekly commentary, dated 7/18/22, entitled Refocusing the Fed\n\n**https://www.census.gov/library/stories/2019/12/by-2030\n\n***nytimes.com/interactive/2021/us/covid-cases.html\n\n****thehill.com/homenews/state-watch/3266217-cdc-2021-was-americas-deadliest-year-ever/\n\n*****https://www.azlyrics.com>M>Merle Haggard Lyrics", "id": "62e355b66134dc31786db824"}, {"title": "Is an Impending US Recession Now All but Guaranteed?", "domain": "internationalbanker.com", "url": "https://internationalbanker.com/finance/is-an-impending-us-recession-now-all-but-guaranteed/", "content": "By Cary Springfield, International Banker\n\nIn mid-July, economists at Bank of America (BoA) forecast that the US would experience a \"mild recession\" before the end of the year. \"A number of forces have coincided to slow economic momentum more rapidly than we previously expected,\" the group headed up by BoA's new chief economist Michael Gapen said, with Bloomberg quoting those forces as being \"inflation from food and energy prices that leave households with less available for discretionary purchases, and tighter financial conditions, with higher mortgage rates denting affordability.\"\n\nIndeed, inflation lies at the heart of the US' economic woes at present, and will likely to weigh on American citizens' cost-of-living for much of the rest of the year. Consumer price inflation for June was reported in mid-July to have climbed to 9.1 percent - the highest level since November 1981 as rising fuel costs stemming from the war in Ukraine and global supply-chain disruptions have sent prices skywards in recent months. Prices were already experiencing upward pressure last year as the US economy reopened following the COVID-19 pandemic-induced shutdowns and the massive fiscal stimulus injected into the economy in early-2021. Such factors are now prompting the Federal Reserve to raise interest rates sharply, but doing so could well initiate a \"hard landing\" whereby the economy is sent plummeting into recession territory, officially defined as negative economic growth for two consecutive quarters.\n\nAs such, BoA has pencilled in a decline of 1.4 percent of gross domestic product in the fourth quarter from a year earlier, followed by an increase of 1 percent in 2023, which should boost the unemployment rate by 1 percent and thus help to cool inflation. The Bank also anticipates that the Federal Reserve will raise its benchmark federal funds rate to a target range of 3.25-3.5 percent by the end of 2021. \"We think that the Fed will look at the labor-market data and inflation data and conclude that it needs to keep moving at a rapid clip,\" Gapen told Bloomberg.\n\nBoA is not the only major Wall Street institution forecasting a US recession. TD Bank, for instance, puts the probability of a recession materialising at over 50 percent. According to Richard Kelly, head of TD Securities' global strategy division, the unenviable combination of soaring gas prices, a slowing economy and the hawkish policies being implemented by the Federal Reserve represents a palpable threat to the US economy at present. \"We haven't even hit the peak lags from gas prices, and Fed hikes really won't hit until the end of this year. That's where the peak drag is in the economy. I think that's where the near-term risk for a U.S. recession sits right now,\" Kelly explained to CNBC on July 11. \"Then, if you get past that, there's the overall gradual slowing as we get into probably the middle or back half of 2023.\"\n\nBut even if a mild recession does transpire, would it be so disastrous if it ultimately means bringing inflation back consistently to the Fed's 2 percent target? After all, we are currently witnessing price growth spiralling out of control at a time when unemployment is close to multi-decade lows. From that perspective, a period of aggressive rate-tightening that can reset inflation-expectations whilst only raising unemployment marginally - and thus still keeping it an absolute low - could well be considered by policymakers as making the best of a bad situation.\n\nIndeed, a June survey of economists by the Wall Street Journal (WSJ) put the probability of recession within 12 months at 44 percent which was markedly higher than the 28 percent recorded in the Journal's previous survey in April and the 18 percent recorded in January. And according to the financial news publication itself, a 44 percent recession probability \"is seldom seen outside of an actual recession,\" with the December 2007 and February 2020 readings - both just prior to major US downturns - at 38 percent and 26 percent probabilities, respectively. \"We now believe the U.S. economy is headed for a mild recession in the coming months,\" said Greg Daco, chief economist for consulting firm EY-Parthenon, and one of those surveyed by the WSJ. \"While consumers will continue to spend freely on leisure, travel and hospitality over the summer, a persistently elevated inflation backdrop, surging interest rates and plunging stock prices will erode spending power, severely curtail housing activity and constrain business investment and hiring.\"\n\nBut perhaps even more notable from this latest survey is that most economists did not predict a significant rise in jobless numbers accompanying any such recession. \"They forecast a 3.9 percent unemployment rate at the end of this year and a 4.6 percent unemployment rate at the end of 2023. The US has never had a recession in the post-World War II era with a jobless rate that low,\" the WSJ noted.\n\nEven Fed Chair Jerome Powell has tacitly admitted that a recession could well arise as a bi-product of efforts to tame inflation. \"It's not our intended outcome at all, but it's certainly a possibility,\" Powell admitted on June 22 at a congressional hearing. \"We are not trying to provoke and do not think we will need to provoke a recession, but we do think it's absolutely essential\" to bring down inflation. As such, the Fed is currently pursuing a rate-tightening cycle, the intensity of which has not been seen since the 1980s. \"We're looking for...compelling evidence that inflation is coming down, and we don't have that,\" Powell added. \"There are lots of stories out there about how this should happen, and some people think it's very clear that it will. Until we actually do see it happen, we need to keep moving.\"\n\nBut is a recession now all but guaranteed? Some would suggest not given that the impact which some factors previously had on sending US inflation to 40-year highs may have now be waning. Specifically, energy prices may have already peaked, as oil prices have recently shown signs of heading more permanently below $100/barrel. And should Russia be successful in securing important food corridors through the Black Sea, food inflation is also very likely to cool.\n\nIndeed, not everyone believes the US is destined for a recession. \"I don't think we need a recession to get inflation back in,\" Moody's chief economist Mark Zandi recently explained to Australian Financial Review's \"What Goes Up\" podcast. \"Oil prices are going to roll over. Natural gas prices are going to fall. We're going to see vehicle prices come down as supply-chain issues iron themselves out and we get more vehicle production. Commodity prices, goods prices more broadly, are going to come in.\"\n\nRobust consumer spending might also help the US avoid recession in the end, with the recent results of American banking majors confirming that consumers continue to demonstrate significant confidence in the economy. According to JPMorgan, for example, credit and debit card spending is up 15 percent year-over-year; and while consumers are having to pay much more for gas, travel and dining activity still jumped by a \"robust\" 34 percent. \"You can see how resilient the consumer is in the US through the elevated payment rates and the low level of credit losses,\" Citi CEO Jane Fraser recently remarked on an analyst call.\n\nAnd the banks themselves continue to perform solidly, further strengthening the case against a looming recession. Despite apportioning more in loan loss provisions, lenders are not experiencing any considerable rise in non-performing loans as of yet. \"If you didn't look at anything else -- you just looked at the bank numbers -- you wouldn't be thinking there's a recession around the corner,\" Mark Conrad, a portfolio manager at Algebris Investments, told CNN on July 18.\n\nUltimately, then, much depends on how long this bout of inflation will persist as to whether the US economy can achieve the soft landing the Fed so desires. Improvements in the Ukraine situation would go a long way towards helping the US achieve this goal, but major breakthroughs do not appear to be forthcoming as yet. And should a stalemate persist for much of the remainder of the year and inflation remain near current levels, one wonders what price the Fed and Powell are willing to pay to reset inflation expectations.", "id": "62e355b96134dc31786db826"}, {"title": "Are We in a Recession Right Now?", "domain": "nymag.com", "url": "https://nymag.com/intelligencer/2022/07/are-we-in-a-recession-right-now.html", "content": "Photo: Drew Angerer/Getty Images\n\nThe economy doesn't make a whole lot of sense, does it? For every good piece of data out there (unemployment near multigenerational lows, consumers increasing spending) there's something else (inflation at multigenerational highs, consumers decreasing spending) to cancel it out. On Thursday morning, the federal government reported some more bad news: the economy contracted for the second quarter in a row. So does that mean we're in a recession? Well, that's complicated.\n\nDepending on how you look at it, and politics has quite a lot to do with it, things are going fine or collapsing. But the economy is not a tart you buy from your local bakery; it can be good and you can hate it at the same time. To get a sense of how unwieldy it all is, look at the Federal Reserve. On Wednesday, the central bank's administrators voted to hike interest rates by 0.75 percent for the second consecutive month, sucking out credit from the financial system at a rate unseen since the early 1980s. (To put into perspective how much of a jolt this is to the economy, the last time the Fed raised rates by this much, it took them more than two years to do it). Squeeze credit and the economy slows. Do it enough and you get a recession. It's the kind of situation that's rife with the same contradictions that make it so hard to get a handle on what can fix it: If the economy is doing so bad, why is the Fed taking the kind of actions that indicate it's running hot?\n\nSo when Fed chair Jerome Powell answered questions at a press conference Wednesday, he did, at some minimum level, make things a little bit clearer for those who are confused by the state of the world. \"I do not think the U.S. is currently in a recession,\" he said. \"And the reason is there's just too many areas of the economy that are performing too well,\" he added, referencing the labor market specifically: 2.7 million jobs were filled in the first half of the year, the unemployment rate has declined -- things that you don't normally see when there's a recession. It's an extraordinary statement from Powell considering that neither he nor anyone else has any say about whether the U.S. is officially in a recession. It's unusual since the data around that question would get released the next day.\n\nThe question of whether the U.S. is currently in a recession has taken on greater urgency since the first quarter saw a decline in gross domestic product and the following three months were a period of rising inflation. Powell seemed to not take that much stock in the negative GDP print and noted that those numbers change all the time. And Claudia Sahm -- who, as an economist at the Fed, came up with a widely followed recession indicator that looks at rising unemployment -- wrote that the negative growth has a lot to do with retailers' imports and the weird effects on the supply chain from the pandemic rather than anything to do with the health of the economy.\n\nWhat else annoys me? First quarter GDP is basically Target effed up its inventory management, and supply chains are working out in fits and starts. We do not have a lump of GDP, and I do not have enough hours in the day to explain this. https://t.co/JKDg7tLKjN -- Claudia Sahm (@Claudia_Sahm) July 26, 2022\n\nGDP fell by 0.9 percent in the second quarter, according to the Bureau of Economic Analysis. Colloquially, two-quarters of negative GDP growth has meant a recession, but that isn't an ironclad rule. Since the pandemic, the rules around what to make of economic contractions has basically gone out the window. In 2020, the U.S. had a recession that lasted just a few months, something that nobody denies, even though it didn't fall into the six-month timeframe. And this past quarter was made weird with all kinds of technical disruptions -- like Joe Biden selling oil from strategic reserves, and large inventory overhangs from demand in the early part of the year -- that don't make this a clear picture.\n\nWith all that in mind, it's too soon to say whether we're in a recession or not. But the balance of the evidence seems to point to \"probably not.\"\n\nStill, recessions are in a large part about perception. When the Fed decided to go hard last month and raise rates by three-quarters of a point, they did so in part because of a surprisingly gloomy consumer-sentiment survey. Republicans are already trying to get ahead of whatever comes out of the NBER tomorrow by saying that the media and the White House are putting their thumb on the scales by playing into the bad-vibes economy that people have been feeling for months. Even Conan O'Brien is getting in on it.\n\nThe White House now says it's only a recession if you see a salamander wearing a top hat. -- Conan O'Brien (@ConanOBrien) July 27, 2022\n\nAfter Powell's presser, the Dow Jones Industrial Average rose more than 400 points. Some, like hedge-fund billionaire Bill Ackman, had hoped that he would make a stronger statement about tamping down inflation, but if anything, Powell went in the opposite direction, saying that they wouldn't give out as much information to the public as they have been as the central bank charts its next move. The Fed now takes a month off from its usual schedule and will likely make its next decision in September. Banks like Goldman Sachs think more large hikes are on the horizon, even if they're not as large as the last two, before price increases start to come down. If Powell is right, the Fed might be able to keep a recession at bay -- even if it's just for a little bit longer.\n\nThis post was updated with the most recent economic data.", "id": "62e355bb6134dc31786db827"}, {"title": "AZ Big Media What can douse fiery inflation?", "domain": "azbigmedia.com", "url": "https://azbigmedia.com/business/economy/what-can-douse-fiery-inflation/", "content": "On June 10, 2022, the U.S. Bureau of Labor Statistics released a report showing that inflation hit 8.6% in May, representing the largest 12-month increase since December 1981 and far exceeding the Federal Reserve's target of 2% inflation. With fuel prices reaching record highs and bearish sentiment throughout the stock market, the economic outlook is starting to sour.\n\nThe Wall Street Journal recently conducted a survey of economists and found that they believe there is a 44% chance of recession in the next 12 months, up from 28% in the Journal's April 2022 survey.\n\n\"When it gets that high, it basically means we're either in a recession already, or one is coming,\" says Wayne Winegarden, senior fellow in business and economics at the Pacific Research Institute.\n\nWith the economy facing headwinds thanks in part to soaring inflation, both consumers and businesses will see an erosion of their finances and ability to plan for the future.\n\nInterest rates and inflation\n\nOne tool the Fed has to fight inflation is through adjusting the federal funds rate, which impacts how expensive it is to borrow money. When rates are low, a loan to buy a car, business equipment or home is cheaper since less of the total cost will go to interest. Higher rates, on the other hand, make borrowing more expensive, which has a cooling effect on the economy. Since inflation is commonly thought of as \"too much money chasing too few goods,\" discouraging spending through higher interest rates helps tame prices spiraling upward.\n\nFor example, Stewart Willis, co-founder and co-owner of Asset Preservation Tax & Retirement Services, says Arizona's housing market is starting to stabilize due to the Fed's recent moves.\n\n\"Because interest rates are rising, we're going to see downward pressure of housing prices,\" he says. \"With all things remaining the same, a higher mortgage rate will make the mortgage more expensive, so people can afford less house. We started getting into Monopoly money numbers when it came to housing because you could get a 30-year mortgage at 2.5%.\"\n\nREAD ALSO: Metro Phoenix No. 1 in the nation for highest inflation\n\nSay someone takes out a 30-year, fixed rate mortgage for $500,000 at a 2.5% interest rate to buy a house. The total cost over the life of the loan is $711,323. If that rate goes to 5%, the total sum owed jumps to $966,330. For the buyer to pay approximately the same total cost at a 5% interest rate, they can only afford a $370,000 mortgage -- meaning that interest rates have a direct relationship with purchasing power and prices.\n\nTo that end, the Fed increased the federal funds rate by .75% during its June meeting -- the most aggressive hike since 1994. One concern is that by raising rates too quickly, it will induce a recession.\n\n\"In my viewpoint, [the Fed isn't] going to be able to thread the needle, because the genie is just too far out of the bottle,\" Winegarden says. \"Whether you want to call it a recession or not, you're getting a squeeze in what economists would call the 'real economy.' It affects our daily living, but it's also hitting small businesses. They're in a terrible position to manage the costs compared to large companies.\"\n\nBusinesses to blame?\n\nWhen times get tough, it's a natural human response to look for someone or something to scapegoat. There's a small satisfaction in knowing, despite the unhappiness, that there is a root cause to point to. In today's inflationary environment, the business community has become a popular boogeyman to lay blame upon for the U.S.' economic woes. Accusing businesses of being the cause of inflation is a category error, according to Winegarden.\n\n\"Imagine if businesses all of a sudden started to become greedy, and they all raise their prices. If incomes [are stable] and the money supply isn't growing, we couldn't buy anything,\" he explains. \"You physically can't devalue the dollar through inflation [due to] companies raising prices, because you can't simultaneously raise every price. The only way you could do that is through excessive money creation.\"\n\nWhen it comes to picking on companies, Winegarden notes that people often shoot the messenger. There are, however, many costs incurred by businesses during the initial inflationary phase, after which profits are likely to increase -- followed by a crash.\n\n\"People only tend to remember that profits swung up,\" Winegarden says. \"Greed is a constant, like gravity, so it's not something that's changed that can explain inflation. I am not trying to be naive to think that companies aren't trying to raise prices, of course they are, but that's the push and pull of a healthy market dynamic. People push back and end up with equilibrium prices.\"\n\nSome companies, he continues, are starting to slow down hiring, and there are whispers about layoffs.\n\n\"You have the businesses that are beginning to buckle, you have consumers that are beginning to buckle,\" Winegarden concludes. \"I look at all of that and see that we're hitting a very rough patch. I'd say we will be in a recession at some point in the near future, if we're not already in one. We're feeling those consequences, and they're only going to get worse.\"", "id": "62e355c36134dc31786db82b"}, {"title": "Opinion: The toughest part of the Fed's job may already be done", "domain": "erienewsnow.com", "url": "https://www.erienewsnow.com/story/46973241/opinion-the-toughest-part-of-the-feds-job-may-already-be-done", "content": "The answer largely relies on the mindset of American households and businesses, as inflation is -- to an important degree -- a self-fulfilling prophesy. If consumers believe inflation will ease, they'll be less militant about demanding large pay increases, for instance, and employers will be more resistant to granting them. If expectations are well anchored, too-high inflation will substantially take care of itself once the economy is no longer overheated. So if households and businesses maintain the view that inflation will return to 2% in the not-too-distant future, the Fed's task in accomplishing that outcome will be much easier. In fact, it may have already set expectations in financial markets that are roughly tough-enough in terms of how much it will raise interest rates in the future.", "id": "62e355c66134dc31786db82c"}, {"title": "It will be the Fed's fault if the economy crashes into recession", "domain": "marketwatch.com", "url": "https://www.marketwatch.com/story/it-will-be-the-feds-fault-if-the-economy-crashes-into-recession-11659020032", "content": "The Federal Reserve's interest rate policy is one of the most important economic decisions that our government makes. If it were more widely understood, and the Fed were held more accountable, Fed officials would probably be more careful about the downside risks of raising interest rates too much.\n\nPeople talk about the Fed not being able to bring the economy in for a \"soft landing\" when inflation is too high. But when the Fed gets it wrong, and pushes the economy into a recession--as it has done in ending the vast majority of economic expansions that have taken place in the United States since World War II--it's not like a couple of bumps on the runway. It's more like a plane crash. Millions of jobs can be lost.\n\nThe Fed raised interest rates FF00, another 0.75 percentage points Wednesday, continuing its most aggressive monetary tightening in four decades. How far will this go?\n\nBreaking news: Was Fed's Powell dovish or not? 4 key takeaways from Wednesday's press conference\n\nThe \"inflation hawks,\" e.g. economist and former Treasury Secretary Larry Summers, say that if \"inflation is to be contained, unemployment is likely to rise to somewhere in the vicinity of 6% or more.\" And he appears to be talking about a recession. The difference between even 6% unemployment and the 3.6% we have today is more than 3.9 million jobs.\n\nNo inflation spiral expected\n\nWhy should anyone sacrifice the future of so many people? The argument is that inflation will otherwise become permanently higher, or even spiral out of control.\n\nBut the economists who, with many millions of dollars of resources, produce the most reliable estimates of future U.S. inflation, tell a different story. The International Monetary Fund (IMF) this month projected 3% inflation for 2023. The Organization for Economic Co-operation and Development is projecting 3.5%. And the Federal Reserve itself, in June projected 2.6% for 2023.\n\nFew economists would be scared of these levels of inflation for next year. But the inflation hawks have offered us more to fear than fear itself. What if we have an \"inflationary spiral,\" in which there is some self-reinforcing mechanism that drives inflation continuously upward into dangerous territory?\n\nThe most popular version of this is a wage-price spiral, where rising prices cause workers to demand--and somehow get--higher wages, which leads to higher prices and so on. But clearly that is not the world we are living in. Wage growth has fallen from a 6% annualized rate at the end of last year, to just over 4% for recent months. So, there is no wage-price spiral, nor evidence that we are headed in that direction.\n\nScary scenario B is about expectations: if people or markets begin to increase their long-term expectations of what future inflation will be, that can also spiral upward as prices rise. But that has not been happening either.\n\nThe 5 year break-even rate, which is used as a proxy for market inflation expectations, has been about 2.6% since the start of July; about the same as it was a year ago.\n\nSolidifying inequality\n\nIt is well established that lower-wage workers and Black workers are hit much harder by recessions in terms of both unemployment and lost income. Conversely, in years when the economy is closer to full employment, wage gains are proportionately greater for the lower-paid sectors of the labor force.\n\nSo a Fed that is overly aggressive in raising interest rates is expanding and solidifying the structures of inequality in the American economy, as it has done previously for decades in the past.\n\nAs many economists have noted, the vast majority of the increase in inflation that we have seen over the past 18 months has been a result of external shocks, most important the war in Ukraine, which has raised food and energy prices (the CPI energy index rose 41.6% over the past year from June); and the economic disruptions caused by the pandemic. Some of these prices have begun to reverse; and in any case it's difficult to see how the Fed's interest rate hikes are going to lower these prices, as Fed Chair Jerome Powell stated last month.\n\nAt the press conference Wednesday, Powell said that \"having a soft landing is what we're aiming for\" but added: \"at the beginning we said it was not going to be easy. It was going to be quite challenging to do that. It's unusual. It's an unusual event. It's not a typical event, given where we are.\"\n\nBut the Fed has not explained why a \"soft landing\"--avoiding a recession--would be so difficult. We do not have a giant real estate bubble as in 2006, or a stock market bubble as in the late '90s. Both of these were so large that it could be shown in advance (and it was shown) that they were unsustainable and capable of causing a recession when they burst.\n\nThis time, it's just the Fed's interest rate hikes that are threatening to cause a recession. The Fed should be able to make sure that it doesn't make that mistake.\n\nMark Weisbrot is co-director of the Center for Economic and Policy Research in Washington, D.C. He is the author of \"Failed: What the 'Experts' Got Wrong About the Global Economy\" (Oxford University Press).\n\nRecommended reading\n\nInflation inequality: Poorest Americans are hit hardest by soaring prices on necessities\n\nThe Fed's rate hikes alone won't cure inflation\n\nHow the Treasury Department could prevent mass starvation with no cost to the taxpayers", "id": "62e355ca6134dc31786db82e"}, {"title": "Recession could be on horizon next year", "domain": "clintonherald.com", "url": "https://www.clintonherald.com/opinion/recession-could-be-on-horizon-next-year/article_39d408f0-0c49-11ed-ae30-8b8c62a998a6.html", "content": "Stay up to date on COVID-19\n\nGet Breaking News\n\nSign up now to get our FREE breaking news coverage delivered right to your inbox.", "id": "62e355d36134dc31786db830"}, {"title": "Inflation Down. Risk of Recession Up? | by Joseph Liebreich | Jul, 2022", "domain": "medium.datadriveninvestor.com", "url": "https://medium.datadriveninvestor.com/inflation-down-risk-of-recession-up-51eb12b8000d", "content": "Photo by Kevin Martin Jose on Unsplash\n\nInflation Down. Risk of Recession Up?\n\nDo the Federal Reserve policies aimed to tame inflation guarantee a recession?\n\nIn order to put a stop to inflation, the traditional way is for the Federal Reserve to use one of its powerful tools. Raise interest rates. The theory is that major purchases (cars and houses for consumers, and machinery and equipment for the business sector) typically become more expensive as borrowed money becomes more expensive. (Note: consumer spending accounts for 70% of all spending.) As goods become more expensive, buyers think twice before buying and often stop and/or postpone their purchases. As simple as it sounds, raising interest rates is usually dramatically effective to curtail spending and combat inflation.\n\nBut no financial decision comes without its downside. If interest rates are raised too much, and too many buyers stop buying, the economy goes into a tailspin. Manufacturers stop making products. Workers start being laid off since they're not needed. As workers stop earning, they spend even less, and the economy spirals down.\n\nSo, the case is made that the Federal Reserve must be very careful. Raising interest rates is a good method of reducing inflation, but too much raising is unhealthy for the economy.\n\nThe problem in Europe is possibly more ominous than in the U. S. The European Central Bank wants to raise interest rates like the United States, but rising energy prices in Europe complicate matters. The European economy has been already weakened by those higher energy prices and will take an additional pounding if interest rates rise.\n\nThe Bank of Japan (BOJ) has a similar problem. Its currency, the Japanese yen, has had its buying power drop sharply (inflation), but the BOJ doesn't want to raise interest rates (national pride?), but does want to curtail inflation.\n\nBack to the United States. Looking at the risk of recession, there has been a slowdown in spending in the first quarter of 2022, and second quarter spending was also weak. Those are indications of a recession in the offing. Specifically, housing and manufacturing have shown downturns. Houses are sitting on the market longer as buyers anticipate higher money costs which make purchasing less affordable.\n\nThe labor market is softening as unemployment claims are rising. Out-of-work individuals can't spend as much as working men and women.\n\nThe price of copper and other industrial metals, grains, and oil have dropped which has put a modest damper on inflation. A major cause of the recent inflation was supply chain bottlenecks, and these are gradually being eliminated. The drop in the these prices suggests less inflation is up ahead.\n\nUsing another powerful tool of the Federal Reserve (Fed) is tightening (reducing) the money supply. As there's less supply, the cost of money goes up. This has the same effect as raising interest rates.\n\nAnd how do they do this? Going back to the pandemic, the Fed wanted to be sure there was a lot of money in circulation to keep spending high. So, they bought U. S. bonds and paid for them with money. As the bonds came due, the Fed got paid money. In the past, in order to keep the money supply constant, the Fed would use that money to buy new bonds. Now, to decrease the money supply, as bonds become due, the Fed does nothing, which sucks up money and takes it out of circulation.\n\nAs you might guess, the Fed is executing a delicate balancing act. How will it turn out? Stay tuned.\n\nDisclaimer -- I am not a professional investment, tax or financial advisor. This article only presents material for your information. This is not financial, tax or investment advice. Seek professional advice before making any investment, tax or financial decisions.", "id": "62e355d76134dc31786db832"}, {"title": "Inflation Upends Stimulus Playbook to Avert a Recession", "domain": "bloomberg.com", "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=b235571a-0eef-11ed-862c-437858526b68&url=L25ld3MvYXJ0aWNsZXMvMjAyMi0wNy0yOC9pbmZsYXRpb24tdXBlbmRzLXN0aW11bHVzLXBsYXlib29rLXRvLWF2ZXJ0LWEtcmVjZXNzaW9u", "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.", "id": "62e355d96134dc31786db833"}, {"title": "Opinion: The toughest part of the Fed's job may already be done", "domain": "kesq.com", "url": "https://kesq.com/news/2022/07/27/opinion-the-toughest-part-of-the-feds-job-may-already-be-done/", "content": "Opinion by David Wilcox for CNN Business Perspectives\n\nThe US economy may have begun to cool some, but it is still seriously overheated. Employers are desperate to hire workers, but they are nowhere to be found. Customers are eager to purchase new cars, but dealer lots are almost bare. Would-be vacationers are anxious to make up for lost time, but airlines can't handle the volume.\n\nAs a result of that overheating, inflation has surged. In May, the Personal Consumption Expenditures price index, the measure the Federal Reserve pays closest attention to, increased by 6.3%. Now, the question is how hard it will be for the Fed to bring inflation back down to its 2% goal -- and how deep a recession may be required to get the job done.\n\nThe answer largely relies on the mindset of American households and businesses, as inflation is -- to an important degree -- a self-fulfilling prophesy. If consumers believe inflation will ease, they'll be less militant about demanding large pay increases, for instance, and employers will be more resistant to granting them. If expectations are well anchored, too-high inflation will substantially take care of itself once the economy is no longer overheated. So if households and businesses maintain the view that inflation will return to 2% in the not-too-distant future, the Fed's task in accomplishing that outcome will be much easier. In fact, it may have already set expectations in financial markets that are roughly tough-enough in terms of how much it will raise interest rates in the future.\n\nHowever, a more pessimistic outcome is also possible: The experience of escalating prices at the gas pump and grocery store over the past year may have conditioned households and businesses to expect more of the same. In that case, the Fed will need to raise its policy interest rate much higher -- and the economic slump ahead will be much deeper.\n\nBut there are reasons to be optimistic. In the University of Michigan's monthly survey of households, respondents continue to expect much higher inflation over the next 12 months than they anticipated pre-covid. But their longer-term expectations have shifted remarkably little, and are not much higher today than they were a decade ago.\n\nAnother gauge of inflation expectations can be teased out by comparing prices on conventional Treasury securities vs. ones that are protected against inflation. Like the respondents to the Michigan survey, Treasury market investors see inflation over the next five to 10 years coming back into line with the Fed's 2% target.\n\nEven if these longer-term inflation expectations remain well-anchored, the Fed will still have to go ahead with the widely expected hike of three-quarters of a percentage point on Wednesday. And it still will have to follow through with the additional rate increases that financial markets currently anticipate. But so long as consumers continue to believe that inflation will moderate over the longer term, it shouldn't have to raise rates much -- if at all -- beyond that.\n\nThe road ahead is full of uncertainty and likely to be bumpy. Nobody knows what Putin's next moves will be in Ukraine, or what curveballs the coronavirus may have in store for us, or what new snarls may develop in the globe's tangled supply chains. All of those factors and more will play a role in determining the future course of inflation.\n\nOn top of all that, no one knows how much the labor market will cool. The Fed's policy-setting committee expects the unemployment rate to increase about half a percentage point over the next couple of years, consistent with demand and supply in this market coming back into line. But once that softening dynamic is put in motion, accidents can happen; what starts as a mild softening can easily morph into a more serious downturn.\n\nEven if a recession ensues, it will be mild compared to what happened four decades ago. In 1979, Paul Volcker took office as Fed chair amid an even worse outbreak of inflation than we're experiencing now. The public had been conditioned by the experience of the prior 15 years to expect inflation to be high and rising. Partly because of that conditioning, the cost of conquering inflation was tremendous. Volcker and his colleagues had to let the Fed's policy rate go above 20% and tolerate an unemployment rate exceeding 10%.\n\nProgress against today's high inflation won't come as quickly as anyone wants. But a year from now, inflation will have come down substantially from its current level, and by two to three years from now, it should be in the neighborhood of 2%. Everyone will be a little less angry.\n\nIn the meantime, if you listen to Fed Chair Jerome Powell carefully, you'll hear him invoke one name surprisingly frequently -- Volcker, the patron saint of inflation control. There's a reason why he's doing that: If he can persuade the American people that he's serious about controlling inflation, his job will be a whole lot easier.\n\nIn fact, his work may be mostly done already.\n\nThe-CNN-Wire\n\n(tm) & (c) 2022 Cable News Network, Inc., a WarnerMedia Company. All rights reserved.", "id": "62e355db6134dc31786db834"}, {"title": "This kind of shock to the economy will have consequences", "domain": "cnn.com", "url": "https://www.cnn.com/2022/07/27/politics/fed-interest-rate-volcker-what-matters/index.html", "content": "A version of this story appears in CNN's What Matters newsletter. To get it in your inbox, sign up for free here\n\n(CNN) Americans today need to realize that efforts to tame runaway inflation, while arguably necessary, have real consequences that can hurt. A lot.\n\nThere was a time not too long ago when:\n\nThe rich but largely forgotten history of people protesting high interest rates at the Federal Reserve seems nuts today, when Americans are so used to such easy access to borrowed cash.\n\nWe're talking here about the late '70s and early '80s, when high inflation got so baked into the American psyche that killing it took a shock to the system -- leading to everyday interest rates on par with what credit cards charge today.\n\nThe medicine to cure inflation kicked off a double-dip recession -- where a recession was followed by a brief recovery and then another recession -- and put millions of Americans out of work.\n\nThe architect of that shock, former Federal Reserve Chairman Paul Volcker , is today hailed for doing the politically hard thing and creating the environment for decades of subsequent economic growth.\n\nBut he weathered criticism as the inflation died down.\n\nThe President who put Volcker in charge of the Fed, Jimmy Carter, lost his job among a crisis of confidence and malaise from voters. Ronald Reagan would renominate Volcker to a second four-year term before the two fell out.\n\nThe Volcker shock. People this week are recalling the \"Volcker shock,\" which altered the course of the US economy back then, as today's Federal Reserve imposes its second massive rate hike in a row.\n\nRead these articles from CNN Business for the full story on Wednesday's hike:\n\nNow, back to Volcker.\n\nWhat kind of rates were they looking at as Volcker took on inflation?\n\nMortgage rates skyrocketed. Let's look at Let's look at 30-year fixed mortgage rates , which follow along near the rates the Fed controls.\n\nhad shot up to more than 16%. The average 30-year fixed mortgage rate was more than 18%, its meteoric high, in October 1981. The average 30-year fixed rate was already excessive and approaching 12% in October 1979, even before Volcker's dramatic announcement of drastic anti-inflation measures. Within months the average ratehad shot up to more than 16%. The average 30-year fixed mortgage rate was more than 18%, its meteoric high, in October 1981.\n\nToday we are still a very long way from those '80s highs ; 30-year fixed rates have nearly doubled in a year to nearly 6%.\n\nVolcker's legacy is imposing. Every story you read about Volcker will mention he was tall, at 6 feet, 7 inches. But he has an outsize legacy to match.\n\nIn addition to delivering the tough medicine that ended the runaway inflation of the '70s, he's credited with the \"Volcker rule,\" which for a time kept banks from trading their own assets.\n\nChris Isidore wrote CNN's obituary for Volcker back in 2019. I asked him how Volcker might view today's fight against inflation.\n\nHe made these important points:\n\nVolcker was willing to make hard choices. Volcker believed the Fed had to do whatever it took to bring prices back in line. Under his leadership, the central bank raised its benchmark rate as high as 19% in January 1981.\n\nThere were consequences. His high interest rate policy brought on not only one, but two recessions in short order: one from January 1980 that ran through July '80, which was followed in short order by the recession that started in July '81 and went through November 1982.\n\nBy November 1982, the unemployment rate reached 10.8% That was almost a full percentage point higher than it hit in the wake of the Great Recession of 12 years ago.\n\nIt was far worse inflation than we have today. Volcker had far more serious inflationary pressures to battle, with the rate of increase in the Consumer Price Index hitting a high of 14.8% in March 1980, far above the current 8.3% rate.\n\nVolcker faced a wage-price spiral. Many more workers had union contracts than today, and many of those contracts had cost-of-living-adjustments, or COLA, clauses built in that automatically raised wages when prices went up. That's not the case today.\n\nToday the Fed has less control. Many of the factors in today's high inflation are outside of the Fed's control, including spikes in oil and food prices caused by the war in Ukraine, and supply chain problems caused by the Covid-19 pandemic, which are still raising the cost of production of many products and causing shortages in the face of strong demand.\n\nInflation can become a self-fulfilling prophecy\n\nMuch of the Fed's job in taming inflation is to convince people that inflation has been tamed, according to the former Fed official David Wilcox, who is now a senior fellow at the Peterson Institute for International Economics.\n\nJust before this latest rate hike, he wrote an opinion piece for CNN Business , in which he offered two paths for the US:\n\nThe optimistic view is people believe inflation is under control. \"If households and businesses maintain the view that inflation will return to 2% in the not-too-distant future, the Fed's task in accomplishing that outcome will be much easier,\" Wilcox wrote.\n\nThe pessimistic view is people think it's here to stay. \"The experience of escalating prices at the gas pump and grocery store over the past year may have conditioned households and businesses to expect more of the same,\" Wilcox wrote. \"In that case, the Fed will need to raise its policy interest rate much higher -- and the economic slump ahead will be much deeper.\"\n\nWilcox argued Volcker was trying to break Americans out of a general acceptance of too-high inflation. Today, Wilcox sounds optimistic and predicts inflation will be lower within a year and in the target neighborhood of 2% within two or three years -- although who knows what will happen with the pandemic and the war in Ukraine.\n\nWilcox refers to Volcker as \"the patron saint of inflation control\" and notes that current Fed Chair Jerome Powell invokes Volcker's name often.\n\nIt's usually in glowing terms. This spring, Powell commended Volcker for fighting on two fronts, \"slaying, as he called it, the 'inflationary dragon' and dismantling the public's belief that elevated inflation was an unfortunate but immutable fact of life.\"\n\nLet's hope it's not and these interest rate hikes don't have the same unintended consequences that Volcker's had more than 40 years ago.", "id": "62e355dd6134dc31786db835"}, {"title": "Opinion | How Goes the War on Inflation?", "domain": "nytimes.com", "url": "https://www.nytimes.com/2022/07/28/opinion/recession-inflation.html", "content": "The U.S. economy is not currently in a recession. No, two quarters of negative growth aren't, whatever you may have heard, the \"official\" or \"technical\" definition of a recession; that determination is made by a committee that has always relied on several indicators, especially job growth. And as Jerome Powell, the chair of the Federal Reserve, noted yesterday, the labor market still looks strong.\n\nThat said, the U.S. economy is definitely slowing, basically because the Fed is deliberately engineering a slowdown to bring inflation down. And it's possible that this slowdown will eventually be severe and broad-based enough to get the R-label. In fact, on this question I think I'm a bit more pessimistic than the consensus; I think the odds are at least 50-50 that history will say that we experienced a mild recession in late 2022 or early 2023, one that caused a modest rise in the unemployment rate. But what's in a name?\n\nThe real question is whether a moderate slowdown, whether or not it gets called a recession, will be sufficient to control inflation. And the news on that front has been fairly encouraging lately.", "id": "62e355df6134dc31786db836"}, {"title": "Is the US already in a recession?, and more - All About Shipping", "domain": "allaboutshipping.co.uk", "url": "https://allaboutshipping.co.uk/2022/07/27/is-the-us-already-in-a-recession-and-more/", "content": "", "id": "62e355e26134dc31786db837"}, {"title": "US 10-year inflation expectations refresh monthly high at 2.48%", "domain": "fxstreet.com", "url": "https://www.fxstreet.com/news/us-10-year-inflation-expectations-refresh-monthly-high-at-248-202207282251", "content": "However, the recent jump in the US inflation expectations ahead of the Fed's preferred inflation gauge, namely the Core Personal Consumption Expenditure (PCE) Price Index, for July, could underpin the US Dollar Index (DXY) rebound from a three-week low.\n\nIt should be noted that the Flash readings of the US Q2 GDP printed -0.9% Annualized figure versus 0.5% expected and -1.6% prior. With the second consecutive negative GDP print, the US fall into a \"technical recession\", which in turn probes the Fed hawks and exerts downside pressure on the US dollar.\n\nAlthough the US economy fell into \"technical recession\" the previous day, inflation expectations data, as per the 10-year breakeven inflation rate per the St. Louis Federal Reserve (FRED), refreshed the monthly high by the end of Thursday's North American session.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice.", "id": "62e36ff86134dc31786dbaf6"}, {"title": "How to Cope With Rising Rates and Inflation | Global Online Money", "domain": "globalonlinemony.com", "url": "https://globalonlinemony.com/how-to-cope-with-rising-rates-and-inflation/", "content": "Necessary items of data arrived over the previous couple of days, however they do nothing to clear away the fog blanketing the markets and the financial system.\n\nIs the financial system lurching right into a recession? Is inflation coming underneath management?\n\nClear solutions are vital for anybody who has a job or hopes to get one, anybody with payments to pay, a home to purchase or promote, an residence to hire, a mortgage to make or repay, or investments to fret about. Actually, for almost everybody.\n\nHowever no one has these solutions.\n\nIt might be higher, clearly, if there have been extra readability, however it merely doesn't exist. Prudent folks will want function on two tracks: getting ready for short-term hassle, whereas investing for the long run.", "id": "62e47d0c6134dc31786dd5e8"}, {"title": "We're Not In A Recession, But We Could Be Soon", "domain": "huffpost.com", "url": "https://www.huffpost.com/entry/recession-definition-democrats_n_62e3ff0be4b09d14dc42518d", "content": "There is a political debate over whether the U.S. economy is in a recession.\n\nRepublicans say that because gross domestic product, a key economic metric, has been negative for the past two quarters, that's a recession. Democrats point out, correctly, that job growth is strong and the definition of a recession is not so simple.\n\nBut the debate misses an important point: There is a real risk of recession, and whether one happens is largely a decision of the U.S. government. The Federal Reserve is hiking interest rates to quell inflation, and there could be major collateral damage.\n\n\"We're not trying to have a recession,\" Federal Reserve Chair Jerome Powell said this week. \"And we don't think we have to.\"\n\nAdvertisement\n\nHigher rates make money more expensive to borrow, which makes people and businesses spend less. This results in less overall demand for goods and services, which hopefully leads to companies lowering their prices to win over shyer buyers.\n\nA potential side effect of lower consumer spending is millions of people losing their jobs -- but Powell doesn't say it that way.\n\n\"If you translate Fed-speak into people-speak it doesn't sound great,\" Claudia Sahm, a senior fellow at the Jain Family Institute and a former Federal Reserve economist, said in an interview with HuffPost.\n\nSahm praised Powell for communicating more to the public than his predecessors. But Fed-speak is abstract. Powell says inflation is caused by an imbalance of supply and demand, with too much of the latter and not enough of the former. Raising interest rates reduces demand, and that's how the Fed restores balance. He acknowledges that achieving balance will involve a necessary \"softening of labor market conditions.\"\n\nAdvertisement\n\nThe big question: How much softer should the labor market get?\n\nPowell said that despite shrinking gross domestic product, he doesn't believe the economy is in recession because the labor market is still so strong. The National Bureau of Economic Research, the official recession scorekeeper, says a recession involves \"a significant decline in economic activity that is spread across the economy and lasts more than a few months,\" with a major impact on payroll employment.\n\nThe national unemployment rate is 3.6%, which is very low by historical standards. Many economists believe that when unemployment is too low, it can cause inflation and that there is a \"natural\" rate of unemployment that does not cause inflation. If the unemployment gets lower than the natural rate, the theory goes, then inflation goes up because too many people are earning and spending.\n\nPowell suggested at a press conference Wednesday that the natural unemployment rate is probably not 3.6% right now.\n\n\"It could be higher,\" he said. \"And my own instinct is that the natural rate of unemployment is higher.\"\n\nSahm said that Powell is essentially saying the actual unemployment rate needs to be higher. One estimate of the natural rate puts it above 5%. \"Going from 3.6 to five? That's a recession,\" Sahm said.\n\nAdvertisement\n\nSome economists, Sahm included, are skeptical that there's such a clear link between inflation and unemployment. And many have questioned whether the Fed should squash demand when supply chain problems - such as COVID lockdowns in China - are major reasons for the imbalance of supply and demand.\n\nA reporter asked Powell on Wednesday what he would say to the workers who might lose their jobs as higher interest rates clamp down on economic activity.\n\n\"I guess the first thing I would say to every household is that we know that inflation is too high,\" Powell said. \"We understand how painful it is. Particularly for people who are living paycheck to paycheck and spend most of that paycheck on necessities, such as food and gas. And heating their homes. And clothing and things like that. We do understand that those people suffer the most.\"\n\nAs for job loss, Powell went abstract: \"As I mentioned, there will be some, in all likelihood, some softening in labor market conditions. We need growth to slow to below-potential growth. We don't want this to be bigger than it needs to be, but ultimately if you think about the medium and longer term, price stability makes the whole economy work. It's what can give us a strong labor market and wages that aren't being eaten up by high inflation.\"\n\nSahm thought Powell's answer was frustrating.\n\n\"Those paycheck-to-paycheck people are going to be the first to lose their jobs,\" she said. \"I wish they would be a little more straight up about what it's going to mean.\"", "id": "62e47d0f6134dc31786dd5e9"}, {"title": "Some Good Inflation News Coming Soon, Cresset Capital", "domain": "forbes.com", "url": "https://www.forbes.com/sites/simonconstable/2022/07/27/some-good-inflation-news-coming-soon-cresset-capital/", "content": "", "id": "62e47d106134dc31786dd5ea"}, {"title": "Recession Fears and Opportunity", "domain": "advisorhub.com", "url": "https://www.advisorhub.com/resources/recession-fears-and-opportunity/", "content": "", "id": "62e47d1e6134dc31786dd5ec"}, {"title": "Inflation vs. recession: Can Fed avoid crashing the economy?", "domain": "ocregister.com", "url": "https://www.ocregister.com/2022/07/29/inflation-vs-recession-can-fed-avoid-crashing-the-economy/", "content": "The Federal Reserve is in a tough spot.\n\nInflation is soaring and it's the central bank's job is to tame it -- but that effort requires some less-than-popular actions.\n\nIn six weeks, the Fed has twice pushed up the interest rates it controls. Related hikes in financing costs have chilled housing and other industries.\n\nSo what are the odds the Fed can pull off this high-wire act -- significantly moderate inflation without creating an economic meltdown?\n\nBelow is an online tool that allows you to rate 12 risks the Fed faces as it navigates this challenging inflation-correction chore. Use the scroll bar on the right-hand side to move through the questions, hitting the \"submit\" button after each response.\n\nOnce you're done, the quiz will compile what your answers suggest the Fed's odds are of pulling off the tricky feat.\n\nOr, you can go directly to the questionnaire at https://bit.ly/fedrisks!\n\nJonathan Lansner is the business columnist for the Southern California News Group. He can be reached at jlansner@scng.com", "id": "62e47d216134dc31786dd5ed"}, {"title": "How to Cope With Rising Rates and Inflation", "domain": "nytimes.com", "url": "https://www.nytimes.com/2022/07/29/business/rising-rates-inflation-recession.html", "content": "Important pieces of information arrived over the last few days, but they do nothing to clear away the fog blanketing the markets and the economy.\n\nIs the economy lurching into a recession? Is inflation coming under control?\n\nClear answers are important for anyone who has a job or hopes to get one, anyone with bills to pay, a house to buy or sell, an apartment to rent, a loan to make or repay, or investments to worry about. Really, for just about everyone.\n\nBut nobody has those answers.\n\nIt would be better, obviously, if there were more clarity, but it simply does not exist. Prudent people will need operate on two tracks: preparing for short-term trouble, while investing for the long term.", "id": "62e47d256134dc31786dd5ee"}, {"title": "Recession vs inflation: Rising interest rate winners and losers as Fed tightens the screw", "domain": "capital.com", "url": "https://capital.com/recession-inflation-fed-reserve-interest-rate", "content": "Are there any winners and losers on Wall Street after Fed's latest rate hike?\n\nNow that the US Federal Reserve has announced its latest interest rate hike to cool inflation and the market has priced-in a potential recession, the winners and losers on Wall Street are beginning to surface.\n\nFrom the usual havens in utilities (XLU) and real estate (XLRE) during economic downturns, to a return to growth stocks in big tech like Apple (APPL) and Amazon (AMZN), traders are now positioning themselves for the bear market rallies to come.\n\nWinners: The usual suspects + Mega-cap tech\n\nEdward Moya, senior market analyst for OANDA in New York told Capital.com, \"A strong recession signal has brought defensive trading back to life on Wall Street, with utilities and real estate soaring.\"\n\n\"The second consecutive quarterly contraction suggested that stagflation is here, as traders prepare for additional bear market rallies down the road,\" he said.\n\nReal Estate ( XLRE ) price chart\n\nMoya added, \"Mega-cap tech will also become a safe-haven trade during the recession.\"\n\n\"The go-to trade on Wall Street will be companies rich with cash, decent product cycles, and earnings momentum, while the traditional investor may gravitate towards typical defensive stocks,\" he continued. \"Massive earnings from Apple and Amazon are also providing a boost for risk appetite.\"\n\nAmazon ( AMZN ) price chart\n\nLosers: Low earnings companies + US economy\n\nWith inflation at its highest level in four decades, ongoing supply chain issues related to the Covid-19 pandemic, and the likelihood of a recession, \"Traders should avoid companies with no earnings and high debt,\" Moya warned.\n\nGME 34.21 Current price +0.560% 1D% Trade now Trade now Swap Short: 94 % Swap Long: 6 % Long position overnight fee -0.0225% Short position overnight fee -0.0219% Overnight fee time 21:00 (UTC) Spread Trade now AAPL 162.50 Current price -0.840% 1D% Trade now Trade now Swap Short: 94 % Swap Long: 6 % Long position overnight fee -0.0064% Short position overnight fee -0.0059% Overnight fee time 21:00 (UTC) Spread Trade now GOOG 116.98 Current price +0.690% 1D% Trade now Trade now Swap Short: 96 % Swap Long: 4 % Long position overnight fee -0.0225% Short position overnight fee -0.0219% Overnight fee time 21:00 (UTC) Spread Trade now TSLA 890.18 Current price +4.440% 1D% Trade now Trade now Swap Short: 87 % Swap Long: 13 % Long position overnight fee -0.0225% Short position overnight fee -0.0219% Overnight fee time 21:00 (UTC) Spread Trade now\n\nWhile the market anticipates a slower pace of tightening from the Fed, \"it is premature,\" he said. \"Inflation will likely not ease quickly, so the aggressive stance to fight inflation will not drastically change.\"\n\nUS economy: Burned by inflation, stalled by potential recession\n\nIn an interview with Capital.com, Joey Von Nessen, a research economist at the University of South Carolina's Darla Moore School of Business, said \"two consecutive quarters of negative growth is concerning, but part of what's driving the slowdown is temporary.\"\n\nWhat is your sentiment on AAPL? 162.50 Bullish or Bearish Vote to see Traders sentiment! Market sentiment: Bullish Bearish 94% 6% You voted bullish. You voted bearish. Give AAPL a try Start trading or Try demo\n\nAccording to Von Nessen, there are two major factors driving today's GDP estimates including high inflation and rising interest rates, and \"it can be observed in the housing markets, where demand has pulled back in 2022 as mortgage interest rates rise.\"\n\n\"However, we're also in a period of transition as consumers slowly return to normal spending patterns,\" he added. \"The bottom line is that uncertainty remains high as we look ahead to the second half of the year, which will likely translate into increased market volatility.\"\n\nRead more:", "id": "62e47d296134dc31786dd5ef"}, {"title": "Can Fed avoid crashing the economy? - Orange County Register", "domain": "vigourtimes.com", "url": "https://vigourtimes.com/can-fed-avoid-crashing-the-economy-orange-county-register/", "content": "The Federal Reserve is in a tough spot.\n\nInflation is soaring and it's the central bank's job is to tame it -- but that effort requires some less-than-popular actions.\n\nIn six weeks, the Fed has twice pushed up the interest rates it controls. Related hikes in financing costs have chilled housing and other industries.\n\nSo what are the odds the Fed can pull off this high-wire act -- significantly moderate inflation without creating an economic meltdown?\n\nBelow is an online tool that allows you to rate 12 risks the Fed faces as it navigates this challenging inflation-correction chore. Use the scroll bar on the right-hand side to move through the questions, hitting the \"submit\" button after each response.\n\nOnce you're done, the quiz will compile what your answers suggest the Fed's odds are of pulling off the tricky feat.\n\nOr, you can go directly to the questionnaire at https://bit.ly/fedrisks!\n\nJonathan Lansner is the business columnist for the Southern California News Group. He can be reached at [email protected]", "id": "62e4997d6134dc31786dd866"}, {"title": "Challenges To Inflation Outlook In US Tech Recession", "domain": "nationworldnews.com", "url": "https://nationworldnews.com/challenges-to-inflation-outlook-in-us-tech-recession/", "content": "", "id": "62e4c84c6134dc31786ddb70"}, {"title": "The Only Game in Town: A Trilogy of the Fed, Inflation, and Recession", "domain": "moderndiplomacy.eu", "url": "https://moderndiplomacy.eu/2022/07/30/the-only-game-in-town-a-trilogy-of-the-fed-inflation-and-recession/", "content": "China, India, Vietnam and a number of Asian and Pacific countries are already gearing up for the 7th Eastern Economic Forum scheduled to take place on 5-8 September in Vladivostok, Far East. With the emerging new economic order and the United States and European Union's sanctions on Russia for its \"special military operation\" in the former Soviet republic of Ukriane, the Asian and Pacific countries are stepping up efforts in collaborating in economic sectors in the Russian Federation.\n\nAs part of the preliminary preparations, the Ministry for the Development of the Russian Far East and the Russian Far East and Arctic Development Corporation (FEDC) have organized a roundtable on the development of industry in the Far Eastern Federal District.\n\nAnatoly Bobrakov, Deputy Minister of the Russian Federation for the Development of the Far East and the Arctic and moderator of the roundtable noted that the main economic sectors of the Far East (mining, manufacturing, transport, and logistics) account for 43% of the gross regional product.\n\n\"More than 2,700 projects are currently being implemented in the Far East with state support. Amid unprecedented sanctions, it is important to note that investors are not ready to give up on the declared projects. That, however, they face multiple risks caused by companies from unfriendly countries, when those refuse to supply equipment and components necessary for the implementation of projects or refuse to install and maintain the equipment,\" he explained.\n\nBobrakov believes that it is necessary to create conditions so that the equipment and components would be produced locally in the Russian Federation, including through joint ventures with companies from friendly countries that own technology and know-how. \"I am confident that we can ensure the technological sovereignty of the Russian Federation, provide both our traditional and new industries with technology,\" said Bobrakov.\n\nWhile inviting the participants to the discussion, Darya Kiryanova, Deputy General Director for Economic Development of FEDC also noted: \"What is happening in Russia right now is perceived as a stress on the one hand, but on the other hand is viewed as an opportunity. Domestic industry is facing a challenge to localize production within the country. It is necessary to understand what needs to be reinvented and what can be reused by changing supply chains.\n\nShe would, therefore, like to collect the main issues and problems faced by industrial companies and form a package of proposals and necessary changes in the state policy for further integration into the sessions at the Eastern Economic Forum.\"\n\nMikhail Kuznetsov, Director of the Eastern State Planning Centre (Vostokgosplan), described the current situation in the industrial sectors of the Far East and the Arctic: From 2017 to 2021, the growth rate of the manufacturing industry in the Far East outpaced the national average. Metallurgy, transport engineering, and the chemical industries were among the leaders.\n\nIn 2022, amid growing sanctions pressure, many Russian enterprises faced a shortage of spare parts, chemical components, as well as disrupted supplies channels for finished products. At the same time, the Far Eastern Federal District has the potential of untapped natural resources, growth in transport engineering and cargo transit. This can become the basis for the development of import substitution in the country. However, the product transformation of enterprises requires all available funding, as well as time for technical re-equipment and personnel training.\n\nAccording to Vostokgosplan's Kuznetsov, the most promising enterprises that potentially can help overcome the problem of import substitution are operating in the chemical and machine-building industries. According to the forecasts of the development institution, industrial production in the Far East will grow at a faster pace than the Russian average, and by 2025 this indicator may exceed 15%.\n\nAlexander Didenko, General Director of Metallenergo, and Nikolay Radko, Acting General Director of Rusolovo, and Alexander Patlach, Design Director of Bystrinsk Ore Mining Company, all shared their views on what needs to be improved to strengthen support measures for manufacturing enterprises in the Far East. The speakers noted the importance of creating a tin cluster in the Far East and including it in the list of industrial priorities.\n\nAdditionally, they spoke about revising the terms for transferring land from one category to another for the implementation of industrial projects within an ASEZ. For example, the Bystrinsky Mining Company (the subsoil user and operator of the Kumroch project) plans to create a modern high-tech gold mining and processing plant from scratch in Kamchatka Territory by 2026. The project worth RUB 20 billion will be implemented as an ASEZ resident.\n\n\"Not a single Russian territory can boast such diverse and effective measures to support investors as those in place in the Far East. This is very important when implementing a project,\" says Alexander Patlach.\n\nThe company is currently preparing the relevant documentation and expects to start the advanced development of the Kumroch deposit by the end of the year. The necessary machinery and equipment in the amount of more than 50 units has already been purchased, the investor has prioritized Russian producers, Chinese equipment has been purchased to cover some required positions.\n\nAlexander Didenko, General Director of Metallenergo touched upon the programmes of preferential leasing and Industrial Mortgage. The latter is being launched by the Ministry of Industry and Trade, Ministry of Finance, and Ministry of Economic Development together with heads of several regions.\n\nDidenko said: \"We are waiting, because we have both capacities and resources, which we would like to purchase, but there is not enough working capital. Therefore, we would like to get additional support measures to minimize the regulatory time for consideration of applications.\"\n\nMore detailed information about the relevant support measures for entrepreneurs who want to quickly organize a manufacturing business, was delivered by Nikolai Elantsev, Head of Monitoring and Coordination of Regional Industrial Infrastructure Development of the Department of Regional Industrial Policy and Project Management of the Ministry of Industry and Trade of the Russian Federation.\n\nMaxim Nikiforov, Deputy General Director of Baikalengineering shared the peculiarities of localization of engine and propeller production at Komsomolsk ASEZ and raised the issue of the state commission.\n\nIssues of financing and obtaining bank guarantees were also touched upon by other speakers. Thus, Alexander Korneichuk, General Director of NSRZ proposed to consider the possibility of 0% VAT for the shipbuilding industry.\n\nPresident of the Union of Industrialists and Entrepreneurs of the Republic of Buryatia, General Director of Ulan-Ude Instrument-Making Production Association Vladimir Luchnikov noted the importance of subsidizing interest rates and financial support measures, plus suggested to consider the possibility of establishing a guarantee fund for Far Eastern industrial enterprises. The company is reinvigorating an innovation cluster in Buryatia, including all industrial enterprises of the region, and is focused on the production of import-substituting goods in medicine, aviation, instrument manufacturing, and railway trains.\n\nSergey Yarutin, General Director of the Association of Import Substituting Enterprises, focused on possible directions of import substitution and ways of parallel imports.\n\nAt the end of the discussion, Denis Nevzorov, Director of the Department for International Cooperation and Technological Development of the Far East and the Arctic at the Ministry for the Development of the Russian Far East, informed the audience about the current mechanisms for supporting both existing and planned enterprises. For example, the speaker called the territories of advanced social and economic development the most interesting for the implementation of industrial projects.\n\nAmong the successful examples were the projects of the Zvezda Shipbuilding Complex and Arnika in the Primorye Territory, Sibur, as well as the gas processing and gas chemical plants in the Amur Region. Baikal aircraft production in the Republic of Buryatia is being prepared for implementation. Industrial parks and technoparks are being created in Khabarovsk, Primorye Territory, Yakutia, and Chukotka Autonomous District.\n\nAn investor in an ASEZ is granted tax, infrastructure, land, and construction preferences. Moreover, this regime allows for different mechanisms of state support not only from the Ministry for the Development of the Russian Far East, but also from the Ministry of Industry and Trade, the Ministry of Construction, and the Ministry of Economic Development.\n\nSince May 2022 the Ministry of Economic Development launched subsidies from the federal budget to Russian credit organizations for reimbursement of soft loans. In addition, anti-crisis measures were taken to replenish working capital. Besides, 124 enterprises are included into the list of backbone enterprises, including those in the areas of aviation and shipbuilding. At the same time, since this year the mechanism of the industry development fund has been functioning. If earlier industry subsidies from the budget of the regions was 30 to 70, now it is 10 to 90, according to Denis Nevzorov.\n\nIn addition to the existing ASEZs, Free Port of Vladivostok, Arctic Zone, and Kuril Islands preferential regimes, there is also the current SITC on Russky Island, with tax preferences, labour quotas, and the competition-free provision of land plots.\n\nDaria Kiryanova, Deputy Director General for Economic Development of FEDC, emphasized: \"Whatever the status of your company, whether you use the existing preferential regimes or not, the Ministry for the Development of the Far East and the Arctic together with FEDC are ready to help you implement projects, as we are extremely interested in ensuring that companies and their capacities work effectively.\"\n\nThe Indian pharmaceutical business community supported by the Indian Business Alliance discussed new opportunities and cooperation as well as opportunities for Indian pharmaceutical business by presenting their projects and participating in international economic forums taking place both in Russia and around the world.\n\n\"The Republic of India is a strategic partner of Russia. I am confident that the new partners in the pharmaceutical industry will successfully continue the partnership between the two countries in this area. Moreover, our specialized Healthy Life division will provide communication and consulting assistance for the development of business projects,\" said Alexander Stuglev, Chairman and CEO of the Roscongress Foundation.\n\nIt was during the meeting of 20 representatives of Indian pharmaceutical companies which focused on the need for support and assistance in expediting product registration time in Russia, as well as assistance from the Roscongress Foundation. All of them expressed an interest in participating as partners in the Eastern Economic Forum in Vladivostok (5-8 September 2022) and the Russian Investment Forum in Sochi in February 2023.\n\nThe heads of the companies stressed that the transition from simple commodity supplies to more complex cooperation and localization of production, which in turn will help the emergence of new points of growth, is an extremely important area of cooperation between the two countries. In addition, the parties noted that this process should be launched bilaterally, exclusively in competitive industries.\n\n\"I see a good basis here for deepening bilateral investment ties. And I am convinced that by working together, our entrepreneurs will be able to create new products with high added value, build production chains, and subsequently promote their goods and services in the markets of third countries,\" stressed Sammy (Manoj) Kotwani, head of the Indian Business Alliance.\n\nIn the month of July, similar roundtable brought together about 50 representatives of industrial enterprises, business associations, regional authorities and development institutions, experts, as well as residents of the Far Eastern preferential regime territories. They voiced the most important proposals for further elaboration and inclusion in the industry session of the EEF 2022.\n\nA delegation of the Russian-Chinese Business Council and Chinese partners has already visited the capital of the Russian Far East. The visit was arranged by Gennady Timchenko, Chairman of the Business Council, and Oleg Kozhemyako, Governor of Primorye Territory, with the support of Zhang Hanhui, Ambassador Extraordinary and Plenipotentiary of the People's Republic of China to the Russian Federation, the Russian Presidential Administration, the Russian Chamber of Commerce and Industry, and the Roscongress Foundation.\n\nThe Chinese businessmen held discussions with the Governor of Primorye Territory Oleg Kozhemyako during the RCBC's working visit to Vladivostok. The key issue on the meeting agenda was the development of bilateral cooperation between Russia and China in the face of sanctions imposed by unfriendly countries.\n\nThey expressed confidence that the meeting would help to strengthen the good relations and fruitful cooperation between the business communities of the Russian Far East and China. The Governor of Primorye spoke about the investment potential of the region and invited representatives of Chinese business to take part in the Eastern Economic Forum 2022.\n\nThe Chinese are engaged in the transport infrastructure of Primorye. On the other hand, increasing the supply of high-quality goods to the PRC, and implementing new investment projects. \"We are counting on the help and assistance of the Russian-Chinese Business Council in cooperation with our Chinese colleagues. We aim to expand the turnover and develop border-related ties. I hope this visit is a platform for establishing strong partnership ties,\" said Governor of Primorye Territory Kozhemyako.\n\nIn his welcoming speech, CRBC Executive Director Evgeny Markin noted the importance of developing cooperation between China and the Russian Far East in the current difficult geopolitical situation. \"Russia and China are key partners and reliable allies. I am confident that the delegation's visit will benefit the development of bilateral ties between the business communities of the two countries. For its part, the Russian-Chinese Business Council will make every effort to develop a long-term and fruitful partnership between the Russian Federation and the People's Republic of China,\" he said.\n\n\"Russia and China are key partners and reliable allies. I am confident that the delegation's visit will benefit the development of bilateral ties between the business communities of the two countries. For its part, the Russian-Chinese Business Council will make every effort to develop a long-term and fruitful partnership between the Russian Federation and the People's Republic of China,\" he said.\n\n\"China's economy is developing ahead of the curve, it is stable and sustainable. Our country is now more able and willing than ever to be a reliable partner for Russian business. In the context of sanctions pressure and a difficult political situation, the role of the Far East is becoming extremely important in building profitable cooperation between China and Russia. We hope that the visit of the Business Council delegation will strengthen cooperation between our countries and become a powerful incentive for developing new projects,\" said Piao Yangfan, Consul General of the PRC in Vladivostok.\n\n\"The Eastern Economic Forum is the key business event in the Far East. Every year it brings together a large number of participants that include official delegations, entrepreneurs and members of the expert community. I am confident that this year will be no exception. We expect a high interest from our Chinese partners as well. We are always happy to see them at our events,\" noted Anton Kobyakov, Advisor to the President of the Russian Federation and Executive Secretary of the EEF 2022 Organizing Committee.\n\nThe 7th Eastern Economic Forum will be held from 5 to 8 September 2022 in Vladivostok on the campus of Far Eastern Federal University (FEFU). It is organized by the Roscongress Foundation.", "id": "62e4e2ae6134dc31786ddd5d"}, {"title": "Inflation or Recession, Which Concern Is Driving The Market?", "domain": "seeitmarket.com", "url": "https://www.seeitmarket.com/inflation-or-recession-which-concern-is-driving-the-market/", "content": "In the Trolley Car Problem - The Fed's Predicament, we laid out how the Fed may likely choose to fight inflation at the expense of triggering a recession.\n\n\"Jerome Powell can tackle inflation but risk a recession and lower stock prices. Or he can try to avoid a recession and risk persistently high inflation.\"\n\nOn May 4, 2022, the FOMC policy statement stated, \"the committee is highly attentive to inflation risks.\" Additional comments from Jerome Powell's post-FOMC press conference further warned the Fed was choosing to tame inflation even if it put the economy in a recession.\n\nSome investors were paying attention to the changes in the Fed's tone on May 4th and the hawkish anti-inflation rhetoric in the following weeks. They sensed the Fed decided how to handle their trolley car problem.\n\nHow do we know this? The price relationship between growth and cyclical stocks changed a few weeks after that meeting. Further, bond yields reversed course. These subtle market changes alerted us that the market's inflation concerns were taking a back seat to recession fears.\n\nAssuming its durability, such a change in sentiment can have significant implications for managing portfolio risk and maximizing returns. To help appreciate the market's message, we must first discuss the primary factors driving growth and cyclical stocks.\n\nGrowth Stocks and Discount Rates\n\nGrowth stock investors often pay a high premium for companies that are losing money or have negligible earnings. Simply, they value earnings potential, not recent earnings trends.\n\nDetermining the price of a company with plenty of potential relies on growth forecasts. Equally important is converting growth forecasts or cash flows to a price today. This is done with the present value formula. The formula discounts each future year's expected earnings or cash flows back to today based on an acceptable rate of return, known as the discount rate.\n\nThe discount rate is derived from market interest rates or rates of return of comparable investment options. To emphasize the importance of the discount rate in determining the present value, we create hypothetical cash flows. As we show below, our company loses money in first three years but grows substantially until year 11. At that point, growth is strong, but it begins to moderate. By year 21, the company has met significant competition, and growth rates flatline with overall economic growth rates.\n\nThe following graph shows how the present value of those expected cash flows fluctuate as interest rates change. In our example, an increase in the discount rate from 4% to 5% reduces the present value of the cash flows by 23%.\n\nTo appreciate how the recent surge in interest rates affects the discounting process, consider that in just the first six months of 2022, the ten-year UST yield has risen by 1.5%. Present value discount rates likely rose by an equal or greater amount. Any wonder why high growth stocks led the market lower in the first half of the year?\n\nSide Point on Growth Companies\n\nAs an aside, earnings streams for different companies can widely vary. Apple, for example, is a mature growth company with relatively weak earnings growth. Accordingly, it has less sensitivity to discount rates than our hypothetical company. On the other hand, many disruptive technology companies with high growth potential, like those held in ARK's Disruptive Technology ETF (ARKK) are very sensitive to changes in interest rates.\n\nCyclical Stocks and Economic Activity\n\nUnlike high-growth companies, which depend on discount rates and product-specific growth forecasts, cyclical stocks tend to fluctuate with economic activity and recent earnings trends.\n\nAs a simple example, Exxon shares often correlate with oil prices. Like most goods, the cost of oil is a function of its supply and demand. Oil demand tends to fluctuate with the ebbs and flows of economic activity. The supply side of the equation also changes, but over more extended periods. Further, those changes are often predictable. The obvious caveat is one-off events like the last two years. Given the supply/demand construct, the demand for oil, thus economic activity, is the primary factor driving Exxon's stock.\n\nThe chart below shows the correlation between the ISM Manufacturing Index and Exxon. ISM has an excellent track record of paralleling economic activity.\n\nWhile each company is unique, many broad-based sector mutual funds and ETFs tend to have more concentrated growth or cyclical tendencies. In this vein, we can imply investor views on the economy and interest rates.\n\nShift From Inflation Fears to Recession Fears\n\nThe graphs below compare the technology sector (XLK) representing growth stocks to four cyclical sectors, materials (XLB), industrials (XLI), energy (XLE), and transportation (XTN). While each graph is a little different, they show a downward trend from January into May as cyclical stocks outperformed technology stocks. Starting later in May or early June, technology began to outperform.\n\nThe Fed's aggressive action and hawkish tone on May 4th combined with even stronger anti-inflation language in the following weeks, appear to have persuaded investors the Fed will tame inflation.\n\nBond investors are also finding solace in the Fed's aggression toward inflation. As we share below, the yield on the 10-year Treasury Note may have peaked in mid-June. It has since fallen by half a percent.\n\nInflation Fears Out- Recession Fears In\n\nBased on the graphs above, investors seem to be getting more comfortable the Fed will do its job and relinquish high inflation rates. At the same time, the market appears to be getting less comfortable with the consequences. Recession fears are on the rise.\n\nPer Fortune:\n\nOn Tuesday, Bloomberg Economics attempted to provide some insight, announcing that the chance that a recession will occur sometime in the next 12 months is 38%, according to its economic model. That probability is up from 0% several months ago.\n\nWhy Investors Should Care\n\nThe shift of concern from inflation to the economy is essential to grasp. Assuming inflation does moderate, economic activity worsens, and the Fed maintains its fight against inflation, long-term bond yields should continue to decline. At the same time, interest rate-sensitive companies, like many growth stocks, may outperform cyclical companies that will fall victim to slowing economic activity.\n\nValue stocks outperformed most other sectors in the first half. Technology and high growth may take the crown for the second half.\n\nSummary\n\nWe are laser-focused on the tradeoff between inflation and recession. If the Fed's resolve to fight inflation stays high and they continue to accept the economic cost of their actions, we will rotate to sectors and stocks that benefit from lower interest rates. Increasing bond exposure will also be appropriate.\n\nThe market will test the Fed's resolve to fight inflation. If they flinch and investors think a stall or pivot is in the cards, cyclical stocks will likely outperform growth. Conversely, if they maintain their current determination, growth and technology will likely outperform.\n\nInvestors paying attention to the Fed and the market's take on the Fed will be best situated to withstand what could be a volatile second half of the year.\n\nTwitter: @michaellebowitz\n\nThe author or his firm may have positions in mentioned securities at the time of publication. Any opinions expressed herein are solely those of the author, and do not in any way represent the views or opinions of any other person or entity.", "id": "62e565c16134dc31786de6fb"}, {"title": "Inflation is Here, Recession Talks \"Heat Up\"", "domain": "floridapoliticalreview.com", "url": "http://www.floridapoliticalreview.com/inflation-is-here-recession-talks-heat-up/", "content": "", "id": "62e565c66134dc31786de6fc"}, {"title": "Why the \"Inflation Is Over\" Rally Will Fall", "domain": "alpha-week.com", "url": "https://alpha-week.com/realvision/why-inflation-over-rally-will-fall", "content": "We're witnessing the greatest stock market rally in the aftermath of a Federal Reserve rate hike since the 1970s, as investors seem to be celebrating inflation's end. That's despite the fact that the personal consumption expenditures price index, the Fed's preferred inflation gauge, surged to 6.8% in June, the highest reading since June 1982. Jerome Powell said this week's 75-basis-point move gets the fed funds target range back to \"neutral.\" According to Jim Bianco, \"That only works if you still believe in transitory and inflation is going back to 2%.\" Bianco, the founder of Bianco Research, joins Real Vision's Andreas Steno Larsen to talk about why inflation is not \"over,\" what the Fed will do with \"incoming data,\" and when the recession will become \"official.\" We also hear from David Rosenberg about when and why the market will bottom.", "id": "62e565ca6134dc31786de6fd"}, {"title": "Why the \"Inflation Is Over\" Rally Will Fall", "domain": "realvision.com", "url": "https://www.realvision.com/shows/daily-briefing/videos/why-the-inflation-is-over-rally-will-fall-mX9w", "content": "Why the \"Inflation Is Over\" Rally Will Fall\n\nPublished on July 29th, 2022 Duration 34 minutes", "id": "62e565d06134dc31786de6fe"}, {"title": "How a (Potential) Recession Could Affect Ortho/Spine", "domain": "ryortho.com", "url": "https://ryortho.com/2022/07/how-a-potential-recession-could-affect-ortho-spine/", "content": "In early June, the consumer price index (aka: \"inflation\") reached the highest level in 40 years. In response, the Federal Reserve has started the process (and will likely accelerate soon) of raising interest rates. The capital markets are re-pricing all manner of financial instruments--stocks bonds, derivatives, etc.--in response to inflation as well as over supply chain disruptions, a resurgent COVID-19, lockdowns in China and war in Europe. A recent University of Michigan survey of consumer sentiment showed deepening pessimism over the U.S. economy.\n\nAnd the #1 question: Are we headed into a recession?\n\nWall Street Weighs In\n\nA recession is most simply defined as a period of two or more consecutive quarters of economic decline, or decreased growth rate of gross domestic product (GDP). This downtrend slows production, employment, spending, and household income.\n\nOf course, consistent with the old saying \"If you laid all the economists in the world end-to-end, they still wouldn't reach a conclusion,\" the current range of economic predictions is all over the place. Wall Street mega-banker Morgan Stanley estimates that the odds of a recession are 30% over the coming year. Morgan Stanley's chief U.S. economist Ellen Zentner was quoted as saying, \"accelerating inflation has been a common precursor to recessions.\"\n\nJP Morgan Chase, the largest bank in the U.S., trotted out its economist Bruce Kasman, who pegged the probability of a recession at 35%, saying, \"The risks are skewed decisively to the upside on inflation and to the downside on growth.\"\n\nSwiss bank Credit Suisse, led by Jeremy Schwartz, describes the U.S. economy as on \"the edge of a recession,\" although his analyst team notes \"buffers\" that should be able to shield the U.S. economy from \"spiraling into a broader downturn.\"\n\nIn the meantime, Citigroup economists, led by global chief economist Nathan Sheets, calculate the odds of global recession are around 50%, stating, \"we see recession probabilities as appreciable and rising.\"\n\nHow Could a Recession Affect Medical Technology Sales?\n\nWall Street's analysts are dusting off their old models and checking back at previous recessions to advise clients and investors. Specifically, Wall Street's analytical corps has looked at the 2008-2009 financial crisis for guidance. In general, they are not expecting an imminent crisis, but do warn that medical device manufacturers are not immune from effects of a possible recession.\n\nAgain, taking a page from the 2008-2009 recession, Needham & Company's analysts noted that while capital equipment sales declined for around 12 months, procedure growth was actually more negatively affected and fell for several years after.\n\nThere have been two major American recessions in the past 20 years. While the Great Recession lasted from December 2007 through June 2009 and was the worst U.S. economic downturn since 1937, the 2020 COVID-19 recession was unique in both its severity and brevity--lasting just 3 months: February, March, and April 2020. For this reason, analysts expect that any near-term economic downturn will look more like the 2008-2009 recession.\n\nLarry Biegelsen and fellow analysts at Wells Fargo note an overall 280 basis points (bps) medtech sector deceleration in organic growth, from 7.4% in 2008 to 4.6% in 2009. In 2010, organic growth bounced back to 5.9%. Cardiovascular markets were the least impacted and the most resilient medtech end market during the financial crisis.\n\nWells Fargo analysts also emphasize that medtech in general outperformed the S&P 500 across all of the past four U.S. recessions--Abbott Laboratories, Baxter International Inc, Becton Dickinson and Co, and Johnson & Johnson in particular.\n\nBiegelsen and colleagues do also point out that ortho markets including hips, knees, spine, and trauma were already experiencing a multi-year deceleration trend in 2008.\n\nAnalysts Mike Matson and David Saxon of Needham & Company also analyzed the med tech sector performance data of the last two recessions in the United States. Based on the data, they also feel that the med tech sector is fairly insulated from the risk of recession--yet the risk remains.\n\nMatson and Saxon wrote to clients that they do not expect a repeat of the Great Recession of 2008-2009 in term of the downturn's severity. As far as how particular companies may be affected, Needham's analysts cite type of payer mix (Medicare v. private pay), types of procedure (non-elective or elective), and type of product (single-use, implantable, or capital equipment) as critical factors.\n\nMatson and Saxon say the capital equipment category is the most vulnerable to economic downturns, particularly for replacement (and therefore deferable purchase) durable equipment (i.e., hospital beds) Companies with more capital equipment exposure, more deferrable or elective procedures, higher private payer mix or out-of-pocket procedures are more likely to see the most detrimental effects in the case of a recession, they predict.\n\nMatson and Saxon also highlight the differences between 2008 and now, such as the fact that out-of-pocket burdens on patients have increased with the rise in use of high-deductible insurance plans. Average deductibles have also increased 6% from 2013-2020, growing from 3.3% of average household income in 2010 to 4.7% in 2020. This means families may be more likely to defer elective procedures. Alternately, however, the analysts note that the Affordable Care Act (ACA) of 2010 has altered the market since that recession, decreasing the uninsured population from 16.6% of the non-elderly in 2013 to 10.5% in 2015. The ACA protection of health insurance in the event of job loss could mitigate impacts on procedural growth.\n\nInvestment firm BlackRock also points out that recent performance in healthcare sectors was driven by COVID-19 beneficiaries such as Pfizer and Johnson & Johnson, both of whom benefited from FDA approval of COVID-19 vaccines and antibody treatments. The medical devices companies responsible for COVID-19 diagnostic and testing kits also saw significant returns, the firm noted. BlackRock, though, said in its Global Healthcare Outlook 2022 that it remains cautious regarding investment in COVID-19 beneficiaries as more highly effective treatments for the virus are available.\n\nOther investment firms like Hartford Funds present more positive outlooks for the 2022 healthcare sector, due to ongoing innovation in biopharma, medical technology, and healthcare services, such as breakthroughs in disease treatment, new drug research, and immunology. These experts also note that the COVID-19 pandemic has made consumers become less dependent on hospitals and more likely to utilize less expensive healthcare delivery options such as home health or telehealth.\n\nLooking Forward\n\nAccording to analysts at William Blair and RBC Capital Markets, medical device companies and small medtech businesses will most likely limit spending in the second half of 2022, amidst rising inflation, staffing shortages, and fears of recession. Both companies state that trends like hospital staffing shortages, supply chain constraints, inflation and hospital staffing shortages have been affecting the medical device company market since the second half of last year. Such factors have already limited post-pandemic economic recovery. A potential recession added into the mix has the medtech industry on watch.\n\nMatson and Saxon say that medtech stock prices are probably not reflecting recession rates currently, but that while large-cap medtech stocks were trading at a next 12 months price/earnings ratio (NTM P/E) of ~21x as of 6/22/22, medtech stocks might fall to a low-teens NTM P/E in a severe recession, or to high-teens NTM P/E in the case of a less extreme recession.\n\nStay tuned, for sure.", "id": "62e644076134dc31786df402"}, {"title": "Recent reports confirm high inflation and rising rates have led to a recession", "domain": "kitco.com", "url": "https://www.kitco.com/commentaries/2022-07-29/Recent-reports-confirm-high-inflation-and-rising-rates-have-led-to-a-recession.html", "content": "Both gold and silver prices have spiked dramatically higher over the last two weeks and accelerated their upward momentum over the last two days. Gold and silver prices have moved to new multiweek highs in response to three major reports and events that have confirmed what the American public has been acutely aware of for some time. First, that inflation is running rampant and continues to spiral out of control to higher levels. Based on the latest CPI numbers inflation is running at a 41-year high of 9.1%.\n\nThis is despite dramatic and extremely hawkish action by the Federal Reserve which has raised interest rates over the last four consecutive FOMC meetings in higher increments. Beginning in March the Fed raise rates by 25 basis points. The following FOMC meeting in May resulted in the Fed raising rates by 50 basis points. This was followed by 75 basis point rate hikes at both the June and July FOMC meeting.\n\nDespite their dramatic attempt to reduce inflation, the core CPI reported a few weeks ago had a fractional decline from 5.9% to 5.7%. However today the government reported that the core PCE price index increased by 0.5%. This means that PCE prices are expected to be up 6.6% YoY (Year-on-Year), and core PCE prices are up 4.7% YoY.\n\nThese latest reports indicate that the Federal Reserve's aggressive rate hikes have been ineffective in reducing \"headline\" and core inflation. Recent rate hikes by the Federal Reserve have taken the Fed funds rate from near zero to 2.25% leading to only one major accomplishment if you can call it that. They have effectively contracted the U.S. economy for the last two consecutive quarters.\n\nIt is emphatically clear that the United States economy has met the definition of a recession regardless of what the government wants us to believe. Therefore, yesterday and today's extremely robust move in both gold and silver are highly warranted and long overdue.\n\nWhatever spin the president and other political entities are conveying to falsely express that the American economy is robust and growing is going against the grain of truth. GDP over the last two quarters by definition infers that we have entered or are in a recession.\n\nThe dollar has had a significant decline in value. After hitting a high above 109 during the week of July 11, the dollar index is now below 106. This is a 3% decline in value in the last three weeks. At the same time, we have seen spot gold rise from a low of $1683 last week and gain approximately $102 as of the close of trading today.\n\nAs of 5:15 PM, EDT spot gold is currently trading up $9.14 or 0.52% and fixed at $1765.34. The August contract of gold futures is no longer the most active contract month, now the most active gold futures contract is December, currently trading at $13.50 higher and fixed at $1782.70.\n\nSilver has had a dramatic run over the last two days gaining 7.45% on Thursday and an additional 2.35% today taking the most active September silver contract to $20.335.\n\nTraders and market participants have finally pivoted their primary focus from rising interest rates to rising inflation. The most recent data from the government clearly defines the utter failure of the Federal Reserve's attempt to bring inflation to an acceptable level. Unquestionably, we most likely will see both gold and silver continue to run to higher pricing.\n\nFor those who would like more information simply use this link.\n\nWishing you as always good trading,\n\nGary S. Wagner", "id": "62e6440c6134dc31786df403"}, {"title": "Is Inflation or Recession Driving the Market? - Articles", "domain": "advisorperspectives.com", "url": "https://www.advisorperspectives.com/articles/2022/07/28/is-inflation-or-recession-driving-the-market", "content": "", "id": "62e70abe6134dc31786e002f"}, {"title": "Op-Ed: Recession denial by White House and Federal Reserve will plunge America into stagflation - L'Observateur", "domain": "lobservateur.com", "url": "https://www.lobservateur.com/2022/07/31/op-ed-recession-denial-by-white-house-and-federal-reserve-will-plunge-america-into-stagflation/", "content": "To combat the highest inflation rate during the height of \"stagflation\" in 1981, the Federal Reserve on Wednesday announced yet another increase to the central bank's overnight interest rate, hiking it 75 basis points. Overall, the Fed has gradually increased interest rates from near 0 to between 2.25 and 2.50 percent in just four months, the fastest tightening of monetary policy since the Fed's attempt to battle stagflation in the early 1980s.", "id": "62e70ac56134dc31786e0030"}, {"title": "Recession Rally Follows Stagflation Selloff", "domain": "seekingalpha.com", "url": "https://seekingalpha.com/article/4528031-recession-rally-follows-stagflation-selloff", "content": "georgeclerk/E+ via Getty Images\n\nThis is an abridged version of the full report published on Hoya Capital Income Builder Marketplace on July 22nd.\n\nReal Estate Weekly Outlook\n\nU.S. equity markets ripped higher this past week after GDP data showing a second-straight quarter of contraction sent long-term benchmark interest rates plunging to their lowest levels since April. Anticipating that recessionary conditions will cool the surge in inflation rates that resulted in a historically brutal first half of 2022 for investment returns, investors shrugged off a second-straight \"triple\" rate hike from the Federal Reserve and inflation data showing that prices continued to rise at 40-year highs in June in a broad-based rally that propelled equity markets to their best month since late 2020.\n\nHoya Capital\n\nDelivering its first back-to-back weekly gains since March, the S&P 500 rallied 4.3% on the week to push its gains for July to 9.1%. The tech-heavy Nasdaq 100 advanced 4.5% on the week and 12% for the month. Domestic-focused market segments continued their outperformance this week as the Mid-Cap 400 and Small-Cap 600 each rallied nearly 5%. Real estate equities and other yield-sensitive sectors were among the leaders for the week. Lifted by retreating long-term rates and a strong slate of earnings reports, the Equity REIT Index advanced 4.7% on the week with 17 of 18 property sectors in positive territory while the Mortgage REIT Index rallied by nearly 7%.\n\nHoya Capital\n\nThe \"bad news is good news\" dynamic was once again the theme of the week - and of the month of July - as a stretch of weaker-than-expected employment, housing, and sentiment data climaxed in a closely-watched GDP report that showed that the U.S. economy shrank at a 0.9% annual rate last quarter, marking a second straight quarterly decline in gross domestic product. Reflecting an anticipated need for the Federal Reserve to pivot on its aggressive tightening path, the 10 Year Treasury Yield dipped to the lowest level since April, retreating by 14 basis points to close the week at 2.64% - barely above the new 2.50% target Fed Funds rate. Buoying hopes for a \"soft landing\" and reversion to the \"Goldilocks\" conditions of the late 2010s, the weak economic data this week coincided with a more upbeat slate of corporate earnings results following a soft start to the quarter with strong reports from energy, real estate, and a handful of mega-cap technology companies.\n\nHoya Capital\n\nReal Estate Economic Data\n\nBelow, we recap the most important macroeconomic data points over this past week affecting the residential and commercial real estate marketplace.\n\nHoya Capital\n\nCounting the chickens before they hatch? Following the downbeat slate of economic data early in the week, inflation data on Friday called into question some of the optimism around an imminent Fed pivot as two closely-watched price gauges - the Core PCE Index and the Employment Cost Index - each posted hotter-than-expected increases. The Core PCE - the Fed's preferred inflation metric - unexpectedly accelerated in June with its highest month-over-month increase since last May. Meanwhile, the Labor Department's employment cost index increased 1.3% in the second quarter from the prior three months, compared with a 1.2% estimate. Rising gasoline prices drove much of the increase, however, as average consumer gas prices in the U.S. peaked in mid-June at $5.03/gallon, but prices at the pump have declined 16% over the past six weeks to $4.20/gallon - roughly consistent with the decline in Crude Oil prices during this period.\n\nHoya Capital\n\nEquity REIT Week In Review\n\nBest & Worst Performance This Week Across the REIT Sector\n\nHoya Capital\n\nAs discussed in our REIT Earnings Halftime Report, we're now at the halfway point of another newsworthy real estate earnings season with 55 REITs representing roughly 50% of the total market capitalization having now reported results. Among the 43 REITs that have provided full-year Funds From Operations (\"FFO\") guidance, 30 REITs (70%) raised their outlook while just 4 REITs (9%) have lowered or withdrawn their outlook. (Excluding several REITs that withdrew guidance due to pending acquisitions.) Strong results from REITs come amid an otherwise disappointing earnings season for the broader equity market as, per FactSet, just 45% of S&P 500 companies boosted their outlook while 55% have lowered. Upside standouts this earnings season have been apartment, shopping center, and industrial REITs. Currency headwinds have been a theme in the technology space, but core results have surprised on the upside while office REITs have been the lone source of negative revisions.\n\nHoya Capital\n\nData Center: Equinix (EQIX) - which has been one of our three \"Best Ideas in Real Estate\" - rallied more than 8% on the week after reporting better-than-expected results driven by record-high levels of gross bookings in the first half of the year. EQIX raised its full-year FFO outlook to 9.5% on a constant-currency basis, up 220 basis points from its prior outlook. Data center REITs have become \"battleground\" stocks in recent months after short-selling firm Chanos & Company launched a $200m fund that will bet against US-listed REITs with a particular focus on data centers. Results from Digital Realty (DLR) were less impressive, however, with gross bookings falling short of estimates and with a slight downward revision in its full-year revenue outlook, consistent with our belief that network-dense data centers - which are the focus of EQIX - are more immune to the persistent competition from hyperscale cloud companies - Amazon (AMZN), Google (GOOG), and Microsoft (MSFT) - with nearly limitless resources.\n\nHoya Capital\n\nApartment: Nine of the ten major apartment REITs have reported results this week - nearly all of which have significantly exceeded expectations. All nine raised their full-year same-store NOI growth target - which is now expected to average more than 13% this year - while seven of the nine boosted their full-year FFO target with an average increase of 2%. Benefiting from the affordability issues plaguing the ownership markets of late, both Sunbelt and Coastal-focused REITs are seeing similar trends of sustained double-digit rent growth, historically high occupancy rates, and record-low turnover. The upside boosts from Camden Properties (CPT) and Mid-America (MAA) bring their cumulative FFO growth since 2019 to over 30%. Among the coastal REITs, Apartment Income (AIRC) - which seemingly continues to fly under-the-radar after its split from Aimco (AIV) in 2020, rallied nearly 9% after raising its full-year NOI outlook and posting its six straight quarter of sequentially accelerating rent growth including the acceleration reported into early July.\n\nHoya Capital\n\nSingle-Family Rental: Invitation Homes (INVH) - the nation's largest housing owner - also reported strong results and raised its full-year NOI and FFO guidance. Citing \"favorable supply and demand fundamentals\" in its markets, INVH saw an acceleration in rent growth in Q2 to an 11.8% blended rate - its strongest quarter on record. The \"embedded\" rent growth potential is substantial with INVH estimating that its current leases are 16% below market rate, on average, as SFR REITs have perhaps been a bit too \"generous\" to existing tenants on lease renewals. The SFR REIT now expects FFO growth of 12.5% this year - up 160 bps from its prior outlook - while also raising its NOI growth outlook by 100 basis points to 10.8%. Notably, INVH did scale back on its acquisition plans for the rest of the year citing the rate-driven rise in its cost of capital, and commented that it is instead looking at opportunities to expand its investment management business.\n\nHoya Capital\n\nNet Lease: Earnings season is still young for the net lease and retail sector, but results thus far have been quite strong while these more rate-sensitive segments have also benefited from the retreat in long-term benchmark interest rates. W.P. Carey (WPC) rallied more than 7% this week after it delivered very strong results, benefiting from its sector-leading upside exposure to inflation through its CPI-linked lease structure. WPC raised its full-year FFO outlook by 40 basis points while delivering record-high same-store rent increases. Results earlier in the week from Essentials Property (EPRT) and Getty (GTY) were also solid - each of which has decent inflation-hedging characteristics per our recent analysis. The week ahead features reports from Realty Income (O), National Retail (NNN), and STORE Capital (STOR).\n\nHoya Capital\n\nShopping Centers: Retail REIT earnings season also got off to a strong start with a trio of better-than-expected results from shopping center REITs. Kimco (KIM) advanced 3% after boosting its full-year FFO growth outlook to 12.3% - up 250 basis points from its prior outlook. Of note, KIM commented that one of the key drivers is their focus on \"last mile locations\" which are seeing positive traffic patterns at 101.3% relative to the same period last year, consistent with the trends discussed in Shopping Center REITs: Winning The Last Mile. Retail Opportunities (ROIC) rallied 6% after it raised its FFO growth outlook to 10.0% this year - up 300 basis points - which would bring its FFO back even with its rate in full-year 2019, driven by double-digit rent growth on same-space new leases and renewals. SITE Centers (SITC) gained 5% after boosting its FFO growth outlook by 170 basis points while recording its highest quarterly new leasing volume since early 2017.\n\nHoya Capital\n\nHealthcare: Lab space-focused Alexandria Real Estate (ARE) rallied more than 10% on the week after reporting better-than-expected results and raising its full-year outlook. As discussed in our report this week, Healthcare REITs: Coming Out of Rehab, lab space demand showed few signs of cooling as ARE's beat was driven by a record rental rate increase - 45.4% GAAP and 33.9% cash - and a historically high leasing volume of 2.3M square feet, the third-highest quarter of leasing volume in the company's history. ARE now sees FFO growth of 8.4% this year - up 40 basis points from its prior outlook - and raised its same-store NOI growth outlook by 30 basis points to 7.8% at the midpoint. LTC Properties (LTC) advanced 6% after the skilled nursing REIT reported an active quarter of lease renegotiations with troubled tenant operators, a chronic issue that has re-emerged for SNF REITs as government relief funds have dried up - a focus in the week ahead with results from Omega Healthcare (OHI) and Sabra Health Care (SBRA).\n\nHoya Capital\n\nMortgage REIT Week In Review\n\nMortgage REITs continued their resurgence over the past week, fueled by a strong bid for mortgage-backed bonds and by generally upbeat earnings results. Residential mREITs gained 5.4% while commercial mREITs rallied 6.0% as the Mortgage REIT ETF (REM) has now rebounded by 27.5% from its recent lows in mid-June. Annaly Capital (NLY) rallied nearly 7% after reporting decent results in Q2 with its distributable EPS beating consensus estimates despite a 12.9% decline in its book value per share (\"BVPS\") while AGNC Investment (AGNC) advanced 4% after posting an identical BVPS decline offset by a similar EPS beat. Annaly and AGNC each provided an upbeat outlook on recent conditions with NLY management citing the \"historically attractive new investment returns\" on Agency MBS. ARMOUR Residential (ARR) also rallied more than 10% after reporting similar results of better-than-expected EPS despite a 14.5% decline in its BVPS.\n\nHoya Capital\n\nHighlights on the commercial mREIT side included Arbor Realty (ABR) - which reported better-than-expected results and raised its dividend for the ninth consecutive quarter - and Blackstone Mortgage (BXMT), which advanced 6% after beating EPS estimates, citing its \"floating-rate portfolio and strong liquidity position.\" Ladder Capital (LADR) also gained more than 6% after reporting a 0.3% increase in its BVPS. Through the first week of earnings season, residential mREITs have reported an average decline in their BVPS of about 11% amid a historically brutal quarter for fixed income securities while commercial mREITs have reported an average BVPS decline of 0.3%. The earnings calendar heats up in the week ahead with results from two dozen mREITs including New Residential (NRZ) on Tuesday, New York Mortgage (NYMT) on Wednesday, and Starwood Capital (STWD) on Thursday.\n\nHoya Capital\n\n2022 Performance Check-Up\n\nThrough seven months of 2022, Equity REITs are now lower by 14.7% on a price return basis for the year while Mortgage REITs have slipped 12.9%. This compares with the 13.3% decline on the S&P 500 and the 11.4% decline on the S&P Mid-Cap 400 as well. Led to the upside by the casino, farmland, and net lease REIT sectors, four real estate property sectors are now in positive territory for the year while the cannabis and regional mall sectors have lagged on the downside. At 2.64%, the 10-Year Treasury Yield has climbed 113 basis points since the start of the year, but has been under pressure since briefly breaking through the prior post-GFC-high rate of 3.25% reached in 2018 and touching an intra-day high in June of 3.50%.\n\nHoya Capital\n\nEconomic Calendar In The Week Ahead\n\nEmployment data highlights another busy week of economic data and corporate earnings reports in the week ahead, headlined by JOLTS data on Wednesday, Jobless Claims on Thursday, and the BLS Nonfarm Payrolls report on Friday. Economists are looking for job growth of roughly 250k in July which would be the lowest month-over-month increase since the start of the pandemic as the U.S. has now recovered 95% of the 22 million jobs lost from the COVID-related economic shutdowns. The unemployment rate, meanwhile, is expected to stay steady at 3.6%. Purchasing Managers' Index (\"PMI\") data will continue to be a major market focus - particularly in Europe and Asia - as recent reports have barely managed to hold on to the breakeven 50-level.\n\nHoya Capital\n\nFor an in-depth analysis of all real estate sectors, be sure to check out all of our quarterly reports: Apartments, Homebuilders, Manufactured Housing, Student Housing, Single-Family Rentals, Cell Towers, Casinos, Industrial, Data Center, Malls, Healthcare, Net Lease, Shopping Centers, Hotels, Billboards, Office, Farmland, Storage, Timber, Mortgage, and Cannabis.\n\nDisclosure: Hoya Capital Real Estate advises two Exchange-Traded Funds listed on the NYSE. In addition to any long positions listed below, Hoya Capital is long all components in the Hoya Capital Housing 100 Index and in the Hoya Capital High Dividend Yield Index. Index definitions and a complete list of holdings are available on our website.", "id": "62e70acc6134dc31786e0031"}]